{
  "hero_roasts": {
    "pudge": [
      "You miss more hooks than a one-armed fisherman.",
      "You're the only Pudge I've seen who can't even hook a creep.",
      "Your Rot is doing more damage to our team's morale than to the enemy.",
      "I’ve seen better hooks in a butcher shop's trash can.",
      "You hide in the trees so much, I'm surprised you haven't started photosynthesizing.",
      "Is your 'Q' key broken, or are you just aiming for the next match?",
      "You're not a butcher, you're just a delivery service for the enemy carry.",
      "Your positioning is so bad, you'd miss a hook on a stationary tower.",
      "Stop trying to be Dendi; you're barely even a bot.",
      "You have the map awareness of a potato in a dark basement.",
      "If hooking air gave gold, you'd be the richest player in Dota history.",
      "Every time you throw a hook, an angel loses its wings... and we lose a tower.",
      "Your Blink Dagger is just a faster way for you to feed.",
      "You’re the only Pudge who manages to hook the only enemy that can kill us all.",
      "I've seen support Pudges with more impact than whatever it is you're doing.",
      "You're like a heat-seeking missile for enemy stuns.",
      "Is your monitor turned on, or are you hooking based on vibes?",
      "You miss hooks so consistently, it's actually statistically impressive.",
      "Your Dismember lasts shorter than your teammates' patience.",
      "You're not 'creating space,' you're just creating a loss."
    ],
    "invoker": [
      "I've seen better spell combinations from a Rubick who just stole his first spell.",
      "You have 10 spells and you still can't win a game. Maybe try a hero with just one button.",
      "Your Sunstrikes land in a different zip code than the enemy.",
      "Watching you try to combo is like watching a toddler play a piano.",
      "You're the only Invoker who manages to Ghost Walk into a Sentry ward every single time.",
      "Your EMP stands for 'Every Move's Pathetic'.",
      "Is Quas-Wex-Exort too many syllables for you to handle?",
      "You invoke spells slower than a dial-up connection.",
      "I’ve seen better Tornadoes in a teacup.",
      "You're not an Arsenal Magus, you're just an Arsenal of Failures.",
      "Your Deafening Blast is the only thing quiet about your gameplay.",
      "Stop worrying about your fancy hair and start hitting your spells.",
      "You've spent the whole game 'preparing' and zero minutes actually playing.",
      "Your Forge Spirits are doing more work than you are.",
      "If you spent as much time practicing as you do typing, we might actually win.",
      "Your Alacrity is the only thing fast about your feed rate.",
      "You're an Invoker who only knows how to Invoke 'Report'.",
      "Your Cataclysm is just a fancy way to show the enemy where you aren't.",
      "I've seen more intelligence from a jungle creep than from your Invoker.",
      "You have the ego of a Miracle- and the skill of a herald."
    ],
    "antimage": [
      "You blink into trees more than a squirrel.",
      "You have the farming skills of a support.",
      "You're called Anti-Mage because you're also Anti-Winning.",
      "Your Battle Fury arrived so late, the enemy team already finished their next game.",
      "You spend 40 minutes in the jungle just to die in 2 seconds in the first fight.",
      "Your Mana Void does about as much damage as a wet paper towel.",
      "Is your Blink on auto-cast for whenever you see an enemy stun?",
      "You're the only AM who manages to get out-farmed by a Crystal Maiden.",
      "Stop blinking into the enemy fountain, it’s not a shortcut.",
      "Your magic resistance doesn't help against your own stupidity.",
      "You're like a pacifist: you refuse to hit anything that isn't a neutral creep.",
      "Your Manta Style just creates two more targets for the enemy to kill.",
      "You have the 'Anti' part down, now work on the 'Hero' part.",
      "I've seen faster farming from a guy with a spoon.",
      "You blink in like a lion and die like a fly.",
      "Your contribution to the game is just a 40-minute silence.",
      "Are you trying to win the game by making the enemy die of boredom while you farm?",
      "Your Counterspell is always one second too late, just like your rotations.",
      "You're the reason 'Avoid Player' was invented.",
      "If blinking away from responsibility was a skill, you'd be Pro."
    ],
    "phantom_assassin": [
      "Your only crit today was a critical failure of judgement.",
      "I've seen more evasion from a politician than from your Blur.",
      "You jump in like you're invincible and evaporate like steam.",
      "Your Stifling Dagger does more damage to my soul than to the enemy.",
      "You're the only PA who can have a 50% crit chance and still hit like a support.",
      "Your BKB lasts 6 seconds, but you usually die in 3.",
      "You're not an assassin, you're just an accidental tourist in the enemy backline.",
      "Watching you play is like watching a roulette wheel that only stops on 'Loss'.",
      "You jump onto the only hero with a Blade Mail every single time.",
      "Your 'Blur' works great because I can't even see your impact on the game.",
      "Is your Coup de Grace on vacation?",
      "You're the reason the enemy team bought Monkey King Bars in the first 10 minutes.",
      "Stop Phantom Striking into certain death; it's not a heroic sacrifice, it's just feeding.",
      "Your farm is so low, you're basically a glorified creep with a cape.",
      "I've seen better RNG from a broken dice.",
      "You're an assassin who couldn't even kill time.",
      "Your Rapier is just a gift you're preparing for the enemy carry.",
      "You're playing PA like you're afraid of the dark... and the light.",
      "Your fan of knives is the only thing 'fan' about your gameplay.",
      "You're not a phantom, you're just a ghost that haunts our win rate."
    ],
    "meepo": [
      "Managing four heroes is hard when you can barely handle the brain cells for one.",
      "I've seen better micro from a broken microwave.",
      "You're not a geo-mancer, you're just a geo-disaster.",
      "One Meepo dies, we all lose. Thanks for making it four times easier for them to win.",
      "You're the only Meepo player who manages to have all four clones in different graveyards.",
      "Your Poof timing is so bad, the enemy has time to recall and come back before you land.",
      "Stop netting the air; the wind isn't the one killing our towers.",
      "You're like a buffet for the enemy Earthshaker.",
      "Watching your clones is like watching a group of puppies trying to solve a math problem.",
      "You have four bodies and zero map presence.",
      "Are you playing Meepo or just giving the enemy team a 4-for-1 discount?",
      "Your micro is so slow, I thought I was watching a slideshow.",
      "You're the reason Meepo has a low win rate in this bracket.",
      "It takes a special talent to feed four heroes at the exact same time.",
      "Your clones are more disorganized than a riot.",
      "I've seen better coordination from a toddler's first steps.",
      "You're not 'stacking' the jungle, you're just 'stacking' the enemy's gold count.",
      "Is your 'Tab' key broken, or do you just have a favorite Meepo?",
      "You play Meepo like you're playing a turn-based RPG.",
      "Four shovels and you still can't dig us out of this hole."
    ],
    "techies": [
      "You're the only person in this game having fun, and even that's questionable.",
      "Your mines are like your contribution to teamfights: invisible and useless.",
      "I've seen more explosive impact from a wet firecracker.",
      "You've spent 20 minutes mining a spot the enemy hasn't visited once.",
      "Stop Blast Off-ing into 5 people; you're a suicide bomber, not a hero.",
      "You're playing a different game, and unfortunately, you're losing that one too.",
      "Your minefield is just a colorful carpet for the enemy Gem holder.",
      "Is your goal to win or just to make the game last 90 minutes out of spite?",
      "You're the human equivalent of a long queue time.",
      "Even your own team wants to report you before the game starts.",
      "Your Reactive Tazer is the only thing 'reactive' about your gameplay.",
      "You place mines like you're trying to decorate the map, not win the game.",
      "I've seen better traps in a Scooby-Doo episode.",
      "You're not an engineer, you're just a nuisance.",
      "Your ultimates are just expensive fireworks for the enemy team's victory.",
      "You're the reason the 'Avoid Player' button was created.",
      "Mining the base at 10 minutes? Way to show your confidence in us.",
      "You're like a bad itch that won't go away, even for the enemy.",
      "Stop clicking the 'Detonate' button on creeps; they aren't the ones winning.",
      "You're not playing Techies, you're just hosting a 40-minute loading screen."
    ],
    "legion_commander": [
      "You've given the enemy carry more damage than their own items have.",
      "Your Duel is just a 5-second countdown to your own death.",
      "I've seen better leadership from a lost tourist.",
      "You Duel the only hero with Blade Mail every single time. Impressive.",
      "You have the 'Commander' title, but nobody is following your bronze-tier plays.",
      "Your Press the Attack is the only thing keeping you from being a total creep.",
      "Stop Dueling the 20-0 Ursa; it's not a 'play,' it's a donation.",
      "You're a Legion of one, and that one is currently feeding.",
      "Your Overwhelming Odds are actually quite low for us winning this.",
      "Winning a Duel requires you to actually hit the target, just so you know.",
      "You use your ultimate like a 'Please Kill Me' button.",
      "I've seen more damage gained by the enemy from you than from their farm.",
      "Your Blink Dagger is just a delivery system for free Duel damage.",
      "You're not an army, you're just a target dummy with a flag.",
      "Is your goal to see how high the enemy's damage can go?",
      "Your Duel timing is as good as a screen door on a submarine.",
      "You're like a gladiator who forgot their sword at home.",
      "Stop 'jungling' for 20 minutes just to lose your first Duel to a support.",
      "Your Moment of Courage is usually the moment you decide to throw the game.",
      "You're the only Legion who manages to lose a Duel to a Crystal Maiden."
    ],
    "lion": [
      "Your Finger of Death is more like a Finger of Mild Discomfort.",
      "You have two stuns and you still can't stop the enemy from killing you.",
      "I've seen better hexes from a budget wizard at a birthday party.",
      "Your Mana Drain is the only thing you're good at, because you're a literal vacuum of skill.",
      "You use your ultimate on 10% HP targets just to 'secure' a kill you didn't earn.",
      "You've been to hell and back, and it looks like you want to go back again... fast.",
      "Your Earth Spike misses more often than your dad's jokes.",
      "You're a Lion that plays like a scared kitten.",
      "Is your 'R' key only for kill-stealing?",
      "You're the reason our carry has no farm; stop 'securing' everything.",
      "Your Hex lasts longer than your impact on the game.",
      "I've seen more frightening things in a Disney movie than your 'hellish' magic.",
      "You're like a walking mana potion for the enemy Antimage.",
      "Stop blinking into 5 enemies just to use one stun and die.",
      "Your Finger stacks are the only thing you care about, while our throne is falling.",
      "You're a support who needs more farm than the carry to be 'useful'.",
      "Your Earth Spikes are so predictable, the enemy is dodging them in their sleep.",
      "You've been to hell and back? Should have stayed there.",
      "You're not 'controlling' the fight, you're just watching it from the fountain.",
      "Your Mana Drain is a great metaphor for how you're draining our team's energy."
    ],
    "juggernaut": [
      "Your Blade Fury is just a fancy way to spin your way into the grave.",
      "You Omnislash creeps more than you Omnislash heroes.",
      "I've seen better swordplay from a guy with a plastic toy.",
      "You're the only Juggernaut who uses Healing Ward *after* the fight is over.",
      "Your mask is to hide the shame of your 0% crit rate.",
      "Is your 'Q' key your only survival strategy? Because it's not working.",
      "You Omnislash the only enemy with Ethereal Blade every single time.",
      "You're not a Juggernaut, you're just a spinning top.",
      "Your Blade Dance is the only thing dancing while our base is being destroyed.",
      "I've seen faster farming from a guy with a rusty spoon.",
      "Stop spinning into the enemy team like you're invincible; you're not.",
      "Your Healing Ward has more HP and utility than you do.",
      "You're the only carry who needs a babysitter for 40 minutes to do 0 damage.",
      "Your ultimate is just a 3-second break for the enemy team.",
      "Is your goal to see how many creeps you can kill before the game ends in a loss?",
      "You're like a blender with no blades.",
      "Your Swift Slash is just a faster way for you to miss your target.",
      "You're a master of the blade? More like a master of the throw.",
      "Your positioning is so bad, even your Omnislash is embarrassed.",
      "You're not the Juggernaut, bitch; you're just a snack for the enemy."
    ],
    "crystal_maiden": [
      "You're so slow, the enemy team has time to finish a meal before you reach the fight.",
      "Your ultimate is just a 'Please Stun Me' sign.",
      "I've seen more durability from a bubble.",
      "You're the only hero who dies to a light breeze.",
      "Your Arcane Aura is the only reason we haven't kicked you out yet.",
      "Stop trying to 'jungle' with Frostbite; the creeps are winning.",
      "Your Crystal Nova is about as cold as your kill-participation stats.",
      "You're like a walking 300 gold bag for the enemy assassin.",
      "Is your goal to see how many times you can respawn in 30 minutes?",
      "I've seen better support from a broken chair.",
      "Your Freezing Field is more like a 'Freezing My Own Progress' field.",
      "You're so fragile, even the courier has more HP than you.",
      "Stop blinking in to use your ult; you're not an Enigma.",
      "Your Frostbite lasts shorter than my patience for your feeding.",
      "You're a Crystal Maiden who plays like a Glass Maiden.",
      "Your movement speed is a crime against humanity.",
      "I've seen more impact from a ward than from your entire kit.",
      "You're the only support who manages to be lower level than the courier.",
      "Your Arcane Aura is great, too bad you aren't.",
      "If feeding was a talent, you'd be a goddess."
    ],
    "sniper": [
      "You stay in the back because you're afraid to play, and you still die first.",
      "Your Shrapnel is just a minor inconvenience, much like your presence in this game.",
      "I've seen better aim from a stormtrooper.",
      "You're the only Sniper who gets jumped by the enemy and blinks *forward*.",
      "Your ultimate is just a fancy way to steal a kill you didn't work for.",
      "You're a 'Sniper' who couldn't hit the broad side of a barn.",
      "Is your Headshot chance actually 0%, or are you just unlucky?",
      "You're like a glass cannon, but without the cannon part.",
      "Your Take Aim is great for watching the enemy destroy our throne from a distance.",
      "I've seen better positioning from a target dummy.",
      "You're the reason people hate playing with Snipers.",
      "Your Assassinate takes so long to channel, the target dies of old age first.",
      "Stop building Rapier if you're just going to hand it over in 2 minutes.",
      "You're the human embodiment of a 'Ho Ho Ha Ha' nightmare, but only for us.",
      "Your Hurricane Pike is just a 1-second delay of your inevitable death.",
      "You're a master of distance, mostly distancing yourself from the win.",
      "Your Shrapnel is the only thing you've contributed to the map in 40 minutes.",
      "I've seen more damage from a support Dazzle than from your 'carry' Sniper.",
      "You play like you're allergic to the enemy heroes.",
      "You're not a sharp-shooter, you're just a dull-witted feeder."
    ],
    "bristleback": [
      "Turning your back doesn't work if you're already dead from stupidity.",
      "Your Quills do about as much damage as a tickle.",
      "I've seen more durability from a wet tissue paper.",
      "You're the only Bristleback who manages to die while facing away from the enemy.",
      "Your Goo is the only thing 'sticky' about your gameplay, because you're stuck in Herald.",
      "Is your goal to see how many stacks of Quills you can miss?",
      "You're like a tank that's made of cardboard.",
      "Your Warpath is just a faster way for you to reach the enemy fountain.",
      "I've seen better back-pedaling from a guilty politician.",
      "You're not a brawler, you're just a punching bag.",
      "Stop running into 5 people thinking you're invincible; you're not.",
      "Your Bristleback passive is great, too bad your brain doesn't have one.",
      "You're the reason 'Silver Edge' was invented.",
      "Your Quills are just a light massage for the enemy carry.",
      "I've seen more impact from a hedgehog on the road.",
      "You're like a walking pin-cushion for enemy spells.",
      "Your Goo is a great metaphor for your current rank: slow and going nowhere.",
      "You're the only Bristleback who builds zero tank items and wonders why he dies.",
      "Your ultimate is called 'Warpath,' but you're on a 'Loss-path'.",
      "You're a master of the back-slap, mostly slapping us in the face with your play."
    ],
    "axe": [
      "Your Culling Blade misses more often than your father's approval.",
      "I've seen better calls from a telemarketer.",
      "You're the only Axe who manages to miss a 5-man call with a Blink Dagger.",
      "Your Counter Helix is the only thing doing work, because you certainly aren't.",
      "Is your 'W' key your only way to feel important?",
      "You're not an Axe, you're just a dull blade.",
      "Your Blink-Call combo is a great way to show the enemy where to stun you.",
      "I've seen more aggression from a pacifist monk.",
      "Stop trying to 'secure' kills with your ult when we need the gold.",
      "You're like a magnet for enemy ultimates.",
      "Your Battle Hunger is the only hunger you have, besides the hunger for feeding.",
      "I've seen better initiation from a shy teenager at a dance.",
      "You're not the 'center of attention,' you're just the center of the feed.",
      "Your Culling Blade is just a fancy execution of our chances to win.",
      "Is your goal to see how many calls you can miss in one game?",
      "You're like a lumberjack who's afraid of trees.",
      "Your Berserker's Call is just a loud way to say 'Please Kill Me'.",
      "You're the only Axe who builds a Vanguard at 30 minutes.",
      "Your armor is high, but your IQ is clearly low.",
      "You're not an Axe, you're just a tool."
    ],
    "slark": [
      "Your Pounce misses so much, I'm surprised you haven't jumped off the map.",
      "I've seen more essence stolen by a tax collector than by your passive.",
      "You're the only Slark who manages to Dark Pact *after* the stun is over.",
      "Your Shadow Dance is just a 4-second delay of your inevitable death.",
      "Is your goal to see how many Essence Shift stacks you can lose in one fight?",
      "You're not an 'escape artist,' you're just a 'feeding artist'.",
      "Your Aghanim's Scepter is just a double-jump into the enemy's arms.",
      "I've seen better ganks from a blindfolded toddler.",
      "Stop Pouncing into certain death; it's not a 'pro move,' it's just stupid.",
      "You're like a fish out of water, literally and figuratively.",
      "Your Dark Pact does more damage to you than to the enemy.",
      "I've seen more impact from a goldfish in a bowl.",
      "You're the reason 'Sentry Wards' are so popular this game.",
      "Your ultimate is called 'Shadow Dance,' but you're just doing a 'Death Dance'.",
      "Is your 'E' key only for decoration?",
      "You're not a 'predator,' you're just a 'snack' for the enemy team.",
      "Your Pounce is a great way to show the enemy where you're going to die.",
      "You're the only Slark who manages to get caught in a Chronosphere every time.",
      "Your Essence Shift is the only thing shifting, specifically our win rate to 0%.",
      "You're not a Slark, you're just a slippery feeder."
    ],
    "wraith_king": [
      "You have two lives and you still manage to be a waste of space in both.",
      "Your Reincarnation is just a second chance for the enemy to get more gold from you.",
      "I've seen better stuns from a flickering lightbulb.",
      "You're the only King who rules over a kingdom of feeders.",
      "Your skeletons are doing more damage and farming better than you are.",
      "Is your 'Q' key the only thing you know how to press?",
      "You're like a 'buy one, get one free' deal for the enemy's kill count.",
      "I've seen more leadership from a headless chicken.",
      "Your Vampiric Spirit is the only thing keeping you alive, and barely.",
      "You're a Wraith King who plays like a peasant.",
      "Stop Reincarnating just to die in the exact same spot 2 seconds later.",
      "Your crit is so rare, I thought you were playing a pacifist build.",
      "You're the human embodiment of a slow-motion car crash.",
      "Is your goal to see how many times you can trigger your ult in one game?",
      "I've seen more impact from a tombstone than from your gameplay.",
      "You're the only carry who needs a second life to accomplish absolutely nothing.",
      "Your stun is just a polite way of saying 'please kill me now'.",
      "You're not a King, you're just a glorified creep with a second health bar.",
      "Your Mortal Strike is the only thing mortal about your skill level.",
      "You're a legend... for being the easiest hero to kite in history."
    ],
    "slardar": [
      "Your Corrosive Haze is the only thing clear about your gameplay: it's invisible.",
      "I've seen better bashes from a toddler with a plastic hammer.",
      "You're the only Slardar who manages to miss a Slithereen Crush on a rooted target.",
      "Your Guardian Sprint is just a faster way for you to reach the fountain.",
      "Is your goal to see how many times you can miss a blink-stun combo?",
      "You're like a fish out of water, literally and figuratively.",
      "Your bash chance is so low, I'm starting to think you're playing a different hero.",
      "I've seen more aggression from a goldfish.",
      "Your ultimate is great, too bad you never use it on the right target.",
      "You're a Slardar who plays like a scared minnow.",
      "Stop sprinting into 5 people thinking you're invincible; you're not.",
      "Your positioning is so bad, even your stun is embarrassed.",
      "You're the only initiator who waits for the teamfight to end before jumping in.",
      "I've seen better ganks from a guy with a bright red neon sign.",
      "Your contribution to the game is just a series of failed stuns.",
      "You're like a walking armor-reduction debuff for our own team.",
      "Is your 'W' key only for decoration?",
      "You're not a Guardian, you're just a liability.",
      "Your sprint makes you take more damage, which is perfect since you love feeding.",
      "You're a master of the deep... deep in the bottom of the scoreboard."
    ],
    "tidehunter": [
      "Your Ravage is so poorly timed, the enemy has time to finish a meal and come back.",
      "I've seen more impact from a splash in a bathtub.",
      "You're the only Tidehunter who holds Ravage until the Ancient is falling.",
      "Your Anchor Smash does about as much damage as a wet noodle.",
      "Is your goal to see how many people you can *not* hit with your ultimate?",
      "You're like a giant green punching bag for the enemy team.",
      "Your Kraken Shell is the only thing keeping you from being a total joke.",
      "I've seen better initiation from a shy turtle.",
      "Stop Gushing at targets that are already dead; it's a waste of mana.",
      "You're a Tidehunter who's afraid of getting wet.",
      "Your ultimate is called 'Ravage,' but you're the one getting ravaged.",
      "I've seen more fearsome things in a seafood restaurant.",
      "You're like a walking sushi platter for the enemy carry.",
      "Is your 'R' key only for when you're the last one alive?",
      "Your Anchor Smash is the only thing you've hit all game, and even that's debatable.",
      "You're the only tank who hides behind the Crystal Maiden.",
      "Your Kraken Shell doesn't protect you from your own bad decisions.",
      "I've seen more map awareness from a sea cucumber.",
      "You're not a sea giant, you're just a big green feeder.",
      "Your Ravage is a great way to show the enemy where you *wish* they were."
    ],
    "enigma": [
      "Your Black Hole is so small, it couldn't even suck in a single creep.",
      "I've seen better gravity from a balloon.",
      "You're the only Enigma who manage to miss a 5-man Black Hole on a stunned team.",
      "Your Eidolons are doing more work than you are, and they're just little blobs.",
      "Is your goal to see how many times you can get your ultimate cancelled?",
      "You're like a black hole of skill: everything good disappears when you play.",
      "Your Midnight Pulse is the only thing 'pulsing' about your gameplay.",
      "I've seen better coordination from a sack of potatoes.",
      "Stop holding Black Hole for the 'perfect moment' that never happens.",
      "You're an Enigma because nobody knows why you're still in this game.",
      "Your ultimate is called 'Black Hole,' but it's just a hole in our strategy.",
      "I've seen more intelligence from a jungle creep.",
      "You're like a walking mana-drain for our team's patience.",
      "Is your 'R' key only for when you're alone in the jungle?",
      "Your Malefice is the only thing 'malicious' about your play.",
      "You're the only initiator who blinks in and forgets to use any spells.",
      "Your Eidolons are tired of carrying you.",
      "I've seen more impact from a ward than from your 'galaxy-tier' plays.",
      "You're not a cosmic force, you're just a cosmic disappointment.",
      "Your Black Hole is a great way to show the enemy exactly where to use their stuns."
    ],
    "rubick": [
      "I've seen better spell steals from a guy who doesn't even know what the spells do.",
      "You steal spells like a kleptomaniac with no taste.",
      "You're the only Rubick who manage to steal a spell and then forget to use it.",
      "Your Telekinesis is just a fancy way to help the enemy reach our carry faster.",
      "Is your goal to see how many times you can die while trying to 'make a play'?",
      "You're like a mirror that only reflects bad gameplay.",
      "Your Fade Bolt does about as much damage as a light breeze.",
      "I've seen more magic from a street performer.",
      "Stop trying to be JerAx; you're barely even a bot.",
      "You're a Grand Magus who plays like a circus clown.",
      "Your ultimate is called 'Spell Steal,' but you're just stealing our time.",
      "I've seen more coordination from a group of stray cats.",
      "You're like a walking encyclopedia of how not to play Rubick.",
      "Is your 'Q' key only for lifting yourself into a stun?",
      "Your Telekinesis is the only thing 'uplifting' about this game.",
      "You're the only support who needs to steal 5 spells just to be mediocre.",
      "Your Fade Bolt is a great metaphor for how your impact is fading.",
      "I've seen more intelligence from a rock.",
      "You're not a master of magic, you're just a master of the throw.",
      "Your Spell Steal is a great way to show the enemy what spells you *wish* you had."
    ],
    "dazzle": [
      "Your Shallow Grave is always 1 second too late, just like your help.",
      "I've seen better heals from a band-aid.",
      "You're the only Dazzle who manage to grave the enemy hero by accident.",
      "Your Poison Touch is the only thing 'toxic' about your gameplay, besides your chat.",
      "Is your goal to see how many people you can *not* save with your ultimate?",
      "You're like a walking doctor who's afraid of blood.",
      "Your Shadow Wave is the only thing 'waving' goodbye to our win rate.",
      "I've seen more support from a wet noodle.",
      "Stop building core items on a hero that can barely keep himself alive.",
      "You're a Dazzle who plays like a dim lightbulb.",
      "Your ultimate is called 'Bad Juju,' and you're the one bringing it.",
      "I've seen more impact from a heal-shrine.",
      "You're like a walking mana-battery for the enemy team.",
      "Is your 'W' key only for when you're the one being attacked?",
      "Your Shallow Grave is a great way to show the enemy exactly who to kill next.",
      "You're the only support who manages to be the first one to die in every fight.",
      "Your Poison Touch is a great metaphor for your current rank: slow and painful.",
      "I've seen more coordination from a broken clock.",
      "You're not a priest, you're just a ritual sacrifice.",
      "Your Shadow Wave is a great way to show the enemy exactly where we're grouped up."
    ],
    "faceless_void": [
      "Your Chronosphere is a better weapon for the enemy team than for us.",
      "I've seen more impact from a clock with no hands.",
      "You're the only Faceless Void who manages to catch 4 teammates and zero enemies.",
      "Your Time Walk is just a faster way for you to jump into a stun.",
      "Is your goal to see how many times you can trap your own carry in a Chrono?",
      "You're like a master of time who's always 5 minutes late to the fight.",
      "Your Time Lock is the only thing 'locked' about your gameplay, besides your skill.",
      "I've seen better aim from a blindfolded sniper.",
      "Stop Chrono-ing the only person on our team who's actually doing damage.",
      "You're a Faceless Void who's also brainless.",
      "Your ultimate is called 'Chronosphere,' but it's just a 'Fail-sphere'.",
      "I've seen more coordination from a bag of hammers.",
      "You're like a walking time-bomb for our own team's morale.",
      "Is your 'R' key only for when you're panicking?",
      "Your Time Dilation is a great metaphor for how you're slowing down our win.",
      "You're the only carry who manages to farm for 40 minutes just to ruin one fight.",
      "Your Time Walk is a great way to show the enemy exactly where you're going to land.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a lord of time, you're just a lord of the feed.",
      "Your Chronosphere is a great way to show the enemy where to dump their ultimates."
    ],
    "lifestealer": [
      "Your Infest is just a way for you to hide from the fact that you're bad.",
      "I've seen more life stolen by a mosquito.",
      "You're the only Lifestealer who manages to die while inside a 5000 HP Pudge.",
      "Your Rage is the only thing you're good at, mostly because you're tilted.",
      "Is your goal to see how many times you can miss a Feast on a tanky target?",
      "You're like a parasite that's not even helpful to the host.",
      "Your Open Wounds are a great metaphor for how much you're hurting our team.",
      "I've seen better aggression from a kitten.",
      "Stop Infesting the courier; it's not a secret ganking strategy.",
      "You're a Lifestealer who's afraid of the light.",
      "Your ultimate is called 'Infest,' but you're just a pest.",
      "I've seen more impact from a leech.",
      "You're like a walking snack for the enemy carry.",
      "Is your 'Q' key only for when you're running away?",
      "Your Feast is a great way to show the enemy how much HP they have left.",
      "You're the only carry who manages to get out-hit by a support.",
      "Your Open Wounds are a great way to show the enemy where you are.",
      "I've seen more intelligence from a rock.",
      "You're not a monster, you're just a nuisance.",
      "Your Shadow Step is a great way to show the enemy exactly where you're going to feed."
    ],
    "earthshaker": [
      "Your Echo Slam is so quiet, I thought you were just clapping for the enemy.",
      "I've seen more impact from a pebble in a pond.",
      "You're the only Earthshaker who manages to block his own team with a Fissure.",
      "Your Enchant Totem is the only thing 'enchanted' about your play, and it's a curse.",
      "Is your goal to see how many 1-man Echo Slams you can do in one game?",
      "You're like an earthquake that nobody even felt.",
      "Your Aftershock is a great metaphor for how we feel after watching you play.",
      "I've seen better coordination from a toddler with blocks.",
      "Stop blinking in and missing your stun; it's embarrassing for all of us.",
      "You're an Earthshaker who's afraid of the ground.",
      "Your ultimate is called 'Echo Slam,' but the only thing echoing is your failure.",
      "I've seen more fearsome things in a petting zoo.",
      "You're like a walking target for enemy Silences.",
      "Is your 'Q' key only for trapping your own carry in the river?",
      "Your Fissure is a great way to show the enemy where to go to avoid you.",
      "You're the only initiator who waits for the entire team to die before jumping in.",
      "Your Enchant Totem is a great way to show the enemy exactly where you're standing.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a world-shaker, you're just a game-thrower.",
      "Your Blink-Echo is a great way to show the enemy exactly where to use their BKB."
    ],
    "storm_spirit": [
      "Your Ball Lightning is just a faster way for you to run out of mana and die.",
      "I've seen more energy from a sloth.",
      "You're the only Storm Spirit who manages to zip into a 5-man stun with 0 mana.",
      "Your Static Remnant is the only thing 'static' about your gameplay: it's not moving.",
      "Is your goal to see how many times you can miss a simple pull-combo?",
      "You're like a bolt of lightning that hit a rubber tree.",
      "Your Overload is a great metaphor for how much you're stressing out our team.",
      "I've seen better ganks from a guy with a loud bell.",
      "Stop zipping into the enemy fountain; it's not a swimming pool.",
      "You're a Storm Spirit who's afraid of the rain.",
      "Your ultimate is called 'Ball Lightning,' but you're just a 'Ball of Feed'.",
      "I've seen more coordination from a group of drunk squirrels.",
      "You're like a walking mana-vortex for our own team's resources.",
      "Is your 'W' key only for when you're already dead?",
      "Your Electric Vortex is a great way to show the enemy where you're standing.",
      "You're the only mid-laner who manages to be level 6 when the enemy is level 12.",
      "Your Static Remnant is a great way to show the enemy where you were 2 seconds ago.",
      "I've seen more intelligence from a rock.",
      "You're not a storm, you're just a light drizzle.",
      "Your Ball Lightning is a great way to show the enemy exactly where to dump their mana-burn."
    ],
    "shadow_fiend": [
      "You have a collection of souls, but clearly none of them know how to play the game.",
      "I've seen better Razes from a gardener with a hedge trimmer.",
      "You're the only Shadow Fiend who manages to miss all three Razes on a stunned target.",
      "Your Requiem of Souls is more like a Requiem for our MMR.",
      "Is your 'E' key just for show, or do you actually plan on hitting a long-range Raze today?",
      "You're like a walking ATM that explodes into a useless pile of souls when killed.",
      "Your Presence of the Dark Lord is the only thing scary about you, and even that's a stretch.",
      "I've seen more impact from a shadow on a wall.",
      "Stop blinking in to ult when you don't even have a BKB; it's just suicide with extra steps.",
      "You're a Shadow Fiend who plays like a Bright Friend.",
      "Your ultimate is called 'Requiem,' and you're definitely singing the song of defeat.",
      "I've seen better coordination from a toddler with a bucket on his head.",
      "You're like a glass cannon that forgot the cannon part at home.",
      "Is your goal to see how many times you can lose all your souls in 20 minutes?",
      "Your Razes are so predictable, the enemy is dodging them while alt-tabbed.",
      "You're the only mid-laner who manages to lose souls faster than you gain them.",
      "Your Necromastery is a great metaphor for how you're mastering the art of feeding.",
      "I've seen more intelligence from a neutral creep.",
      "You're not a demon lord, you're just a goth kid with a bad attitude.",
      "Your Requiem of Souls is a great way to show the enemy exactly where to stand to kill you."
    ],
    "mirana": [
      "Your Sacred Arrow misses so much, I'm surprised you haven't hit a teammate by accident.",
      "I've seen better aim from a stormtrooper with a blindfold.",
      "You're the only Mirana who manages to miss an arrow on a hero trapped in a Chronosphere.",
      "Your Moonlight Shadow is just a way for our team to hide our shame.",
      "Is your goal to see how many times you can Leap into a 5-man stun?",
      "You're like a priestess of the moon who's afraid of the dark.",
      "Your Starstorm does about as much damage as a light drizzle.",
      "I've seen more impact from a shooting star in a cartoon.",
      "Stop trying to be a carry; your right-clicks hit like a support Crystal Maiden.",
      "You're a Mirana who plays like a lost tourist on a cat.",
      "Your ultimate is called 'Moonlight Shadow,' but we can still see you feeding.",
      "I've seen better coordination from a group of panicked squirrels.",
      "You're like a walking delivery service for missed arrows.",
      "Is your 'W' key only for decoration?",
      "Your Leap is a great way to show the enemy exactly where you're going to die.",
      "You're the only support who manages to hit zero arrows in a 60-minute game.",
      "Your Starstorm is a great metaphor for how your impact is fading.",
      "I've seen more intelligence from a rock.",
      "You're not a priestess, you're just a liability on a mount.",
      "Your Sacred Arrow is a great way to show the enemy which direction *not* to walk."
    ],
    "morphling": [
      "Your Attribute Shift is just a way for you to choose between dying fast or dying very fast.",
      "I've seen more stability from a house of cards.",
      "You're the only Morphling who manages to shift to full agility and die to a single support nuke.",
      "Your Waveform is just a faster way for you to reach the enemy fountain.",
      "Is your goal to see how many times you can Morph into a hero and use zero of their spells?",
      "You're like a puddle of water that nobody even bothers to step in.",
      "Your Adaptive Strike does about as much damage as a wet slap.",
      "I've seen more impact from a leaky faucet.",
      "Stop shifting to full strength; you're not a tank, you're just a heavy feeder.",
      "You're a Morphling who plays like a Still-water-ling.",
      "Your ultimate is called 'Morph,' but you're just morphing into a loss.",
      "I've seen better coordination from a bowl of jelly.",
      "You're like a walking science experiment gone wrong.",
      "Is your 'D' key stuck on 'Agility' even when you're being focused?",
      "Your Waveform is a great way to show the enemy exactly where you're going to land and die.",
      "You're the only carry who manages to have 300 HP at the start of every fight.",
      "Your Adaptive Strike is a great metaphor for how you're failing to adapt to the game.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a shapeshifter, you're just a mess.",
      "Your Morph is a great way to show the enemy which of their heroes you're going to feed as."
    ],
    "phantom_lancer": [
      "You have a thousand illusions and yet not a single one of them is doing anything useful.",
      "I've seen better coordination from a hall of mirrors.",
      "You're the only Phantom Lancer who manages to have all his illusions cleared by one support spell.",
      "Your Spirit Lance does about as much damage as a thrown toothpick.",
      "Is your goal to see how many times you can Doppelganger directly into a stun?",
      "You're like a plague of locusts, but without the actual damage part.",
      "Your Phantom Rush is just a faster way for you to reach your inevitable death.",
      "I've seen more impact from a shadow in a dark room.",
      "Stop trying to 'micro' your illusions; it's clear you can't even handle one hero.",
      "You're a Phantom Lancer who plays like a Cardboard Lancer.",
      "Your ultimate is called 'Juxtapose,' but you're just juxtaposing a win with your playstyle.",
      "I've seen better coordination from a group of lost pigeons.",
      "You're like a walking lag spike for our team's morale.",
      "Is your 'W' key only for when you're already dead?",
      "Your Doppelganger is a great way to show the enemy exactly which one is the real you.",
      "You're the only carry who manages to have 10 illusions and still get out-farmed.",
      "Your Spirit Lance is a great metaphor for how you're just throwing things and hoping they work.",
      "I've seen more intelligence from a rock.",
      "You're not an army of one, you're just a crowd of failures.",
      "Your Juxtapose is a great way to show the enemy how many more of you they get to kill."
    ],
    "spectre": [
      "Your Haunt is just a way for you to visit the enemy team one last time before you die.",
      "I've seen more presence from a ghost in a vacuum.",
      "You're the only Spectre who manages to use Spectral Dagger to walk *into* a cliff.",
      "Your Desolate is a great metaphor for your impact on the game: empty and sad.",
      "Is your goal to see how many times you can use Haunt and then not jump to anyone?",
      "You're like a nightmare that we're all having, and we can't wake up.",
      "Your Dispersion is the only thing keeping you alive, and it's barely working.",
      "I've seen better ganks from a guy with a loud megaphone.",
      "Stop trying to 'scale'; the game will be over before you even finish your Radiance.",
      "You're a Spectre who plays like a faint whisper.",
      "Your ultimate is called 'Haunt,' and you're definitely haunting our chances of winning.",
      "I've seen more coordination from a bag of loose feathers.",
      "You're like a walking reminder of why we need a better carry.",
      "Is your 'Q' key only for running away into the trees?",
      "Your Spectral Dagger is a great way to show the enemy exactly where you're hiding.",
      "You're the only carry who manages to be level 10 at 30 minutes.",
      "Your Dispersion is a great way to show the enemy how much damage they're dealing to you.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a shadow of fear, you're just a shadow of a player.",
      "Your Reality is a great way to show the enemy exactly where you're going to feed next."
    ],
    "bloodseeker": [
      "You're called Bloodseeker, but the only blood you're seeing is your own while you're dead.",
      "I've seen better tracking from a broken GPS.",
      "You're the only Bloodseeker who manages to Rupture a hero and then run away from them.",
      "Your Bloodrage is just a way for you to take more damage and die faster.",
      "Is your goal to see how many times you can miss a Blood Rite on a stationary target?",
      "You're like a shark that's afraid of water.",
      "Your Thirst is the only thing high about you, and it's definitely not for winning.",
      "I've seen more impact from a paper cut.",
      "Stop trying to be a race car; you're just a fast-moving target for stuns.",
      "You're a Bloodseeker who plays like a Scab-seeker.",
      "Your ultimate is called 'Rupture,' and you're definitely rupturing our win rate.",
      "I've seen better coordination from a group of dizzy toddlers.",
      "You're like a walking red flag for our team.",
      "Is your 'W' key only for making pretty circles on the ground?",
      "Your Blood Rite is a great way to show the enemy where to walk to stay safe.",
      "You're the only mid-laner who manages to be at half HP for the entire game.",
      "Your Thirst is a great metaphor for how desperate you are for a single kill.",
      "I've seen more intelligence from a rock.",
      "You're not a ritual executioner, you're just a ritual sacrifice.",
      "Your Rupture is a great way to show the enemy that they should just stand still while they kill you."
    ],
    "antimage_persona": [
      "You're using a persona because the original hero was too embarrassed to be seen with you.",
      "I've seen more magic resistance from a wet towel.",
      "You're the only Wei who manages to Blink into a 5-man stun every single time.",
      "Your Mana Void is about as empty as your impact on this game.",
      "Is your goal to see how many times you can fail to reflect a spell with Counterspell?",
      "You're like a disciple of the Turstarkuri who forgot the 'training' part.",
      "Your right-clicks do about as much damage as a gentle breeze.",
      "I've seen better farming from a guy with a broken sickle.",
      "Stop trying to 'carry' with a hero you clearly don't understand.",
      "You're an Anti-Mage who plays like a Pro-Mage feeder.",
      "Your ultimate is called 'Mana Void,' and it's a perfect description of your brain.",
      "I've seen more coordination from a sack of wet flour.",
      "You're like a walking vanity project for our team.",
      "Is your 'E' key only for when you're already hit by the spell?",
      "Your Counterspell is a great way to show the enemy exactly when to wait to stun you.",
      "You're the only carry who manages to have zero items at 20 minutes with a persona.",
      "Your Blink is a great metaphor for how you're just jumping away from responsibility.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a warrior of the monastery, you're just a tourist.",
      "Your Mana Void is a great way to show the enemy team how much mana they still have left."
    ],
    "ursa": [
      "You're an Ursa who plays like a teddy bear.",
      "I've seen more aggression from a sleeping kitten.",
      "You're the only Ursa who manages to miss an Overpower combo on a slowed target.",
      "Your Enrage is just a way for you to delay your death by 4 seconds.",
      "Is your goal to see how many times you can get kited by a support with no boots?",
      "You're like a bear that's afraid of the woods.",
      "Your Fury Swipes do about as much damage as a light tickle.",
      "I've seen more impact from a rug in a lodge.",
      "Stop trying to take Roshan solo when you can't even take a lane creep.",
      "You're an Ursa who's definitely not a 'warrior of the woods'.",
      "Your ultimate is called 'Enrage,' and that's exactly how we feel watching you.",
      "I've seen better coordination from a group of drunk penguins.",
      "You're like a walking target for every slow in the game.",
      "Is your 'Q' key only for making a little hop before you die?",
      "Your Earthshock is a great way to show the enemy exactly how far away they are from you.",
      "You're the only carry who manages to build a Fury Swipes stack of 0 in a teamfight.",
      "Your Overpower is a great metaphor for how you're failing to exert any pressure.",
      "I've seen more intelligence from a rock.",
      "You're not a predator, you're just a snack for the enemy team.",
      "Your Blink-Enrage is a great way to show the enemy exactly where to dump their kiting spells."
    ],
    "clinkz": [
      "Your Skeleton Walk is just a way for you to run away from the fact that you're useless.",
      "I've seen more fire from a damp match.",
      "You're the only Clinkz who manages to use Strafe and then miss every single arrow.",
      "Your Burning Barrage is more like a 'Burning My Own Mana' barrage.",
      "Is your goal to see how many times you can get caught by a Sentry ward in 10 minutes?",
      "You're like a bone archer who's missing his bow and his brain.",
      "Your Death Pact is a great metaphor for the deal you made to lose this game.",
      "I've seen more impact from a campfire on a rainy day.",
      "Stop trying to 'gank' when you die to a single support stun.",
      "You're a Clinkz who plays like a Fragile-Skeleton-man.",
      "Your ultimate is called 'Burning Army,' but it's more like a 'Fading Flare'.",
      "I've seen better coordination from a pile of old bones.",
      "You're like a walking reminder of why invisibility isn't invincibility.",
      "Is your 'E' key only for when the enemy is already on top of you?",
      "Your Skeleton Walk is a great way to show the enemy exactly where to put their Dust.",
      "You're the only carry who manages to have 500 HP for the entire game.",
      "Your Strafe is a great metaphor for how you're just flailing your arms and hoping for the best.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a fletcher of the Searing Chasm, you're just a feeder.",
      "Your Tar Bomb is a great way to show the enemy exactly where they're going to kill you."
    ],
    "lina": [
      "Your Laguna Blade is just a fancy way to secure a kill on a 5 HP support.",
      "I've seen more fire from a cold candle.",
      "You're the only Lina who manages to miss a Light Strike Array on a stunned target.",
      "Your Dragon Slave is about as threatening as a pet lizard.",
      "Is your goal to see how many times you can run out of mana in the first 5 minutes?",
      "You're like a slayer who's afraid of her own shadows.",
      "Your Fiery Soul is the only thing 'hot' about you, and it's not helping.",
      "I've seen more impact from a lighter with no gas.",
      "Stop trying to be a carry; your attack animation is slower than my grandma.",
      "You're a Lina who plays like a 'Dull Flame'.",
      "Your ultimate is called 'Laguna Blade,' but you're just 'Lagging Behind'.",
      "I've seen better coordination from a group of wet matches.",
      "You're like a walking target for every assassin in the game.",
      "Is your 'W' key only for making pretty blue lights on the ground?",
      "Your Light Strike Array is a great way to show the enemy where they were 2 seconds ago.",
      "You're the only support who manages to steal all the farm and still do zero damage.",
      "Your Dragon Slave is a great metaphor for how you're just a slave to the enemy team's whims.",
      "I've seen more intelligence from a rock.",
      "You're not the 'Slayer,' you're just the 'Slain'.",
      "Your Flame Cloak is a great way to show the enemy exactly where to use their burst damage."
    ],
    "abaddon": [
      "Your Borrowed Time is just a way to delay the inevitable for 5 seconds.",
      "I've seen better shields from a wet cardboard box.",
      "You're the only Abaddon who manages to use Aphotic Shield on a full-HP target and miss the carry.",
      "Your Mist Coil does more damage to you than the enemy ever could.",
      "Is your goal to see how many times you can fail to save a teammate with your ultimate?",
      "You're like a lord of Avernus who's afraid of a little mist.",
      "Your Curse of Avernus is the only thing cursed about this game, besides our luck.",
      "I've seen more impact from a band-aid on a broken leg.",
      "Stop trying to be a carry; you hit like a support with a pool noodle.",
      "You're an Abaddon who plays like an 'Abandon-don'.",
      "Your ultimate is called 'Borrowed Time,' and you're definitely living on borrowed skill.",
      "I've seen better coordination from a group of lost ghosts.",
      "You're like a walking reminder of why immortality is wasted on you.",
      "Is your 'W' key only for when you're already stunned?",
      "Your Aphotic Shield is a great way to show the enemy exactly who to burst down next.",
      "You're the only support who manages to die with your ultimate still ready.",
      "Your Mist Coil is a great metaphor for how you're just throwing your life away.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a knight of the house Avernus, you're just a squire who failed his trials.",
      "Your Curse of Avernus is a great way to show the enemy team that they're safe from you."
    ],
    "alchemist": [
      "Your Chemical Rage is the only thing raging here, mostly because of your bad farm.",
      "I've seen more gold from a beggar than from your 20-minute Radiance.",
      "You're the only Alchemist who manages to stun himself with his own concoction.",
      "Your Acid Spray is about as threatening as a spilled soda.",
      "Is your goal to see how many times you can die while carrying 5000 gold?",
      "You're like a scientist who accidentally turned himself into a feeder.",
      "Your Greevil's Greed is a great metaphor for how you're stealing from our team.",
      "I've seen more impact from a penny in a fountain.",
      "Stop trying to farm for 40 minutes when the game is already over.",
      "You're an Alchemist who plays like a 'Fail-chemist'.",
      "Your ultimate is called 'Chemical Rage,' and you're the one making us angry.",
      "I've seen better coordination from a group of greedy goblins.",
      "You're like a walking ATM that the enemy team keeps withdrawing from.",
      "Is your 'W' key only for when you're already surrounded?",
      "Your Unstable Concoction is a great way to show the enemy that you're an explosion waiting to happen.",
      "You're the only carry who manages to have 1000 GPM and zero kills.",
      "Your Acid Spray is a great metaphor for how you're eroding our win rate.",
      "I've seen more intelligence from a rock.",
      "You're not a master of transmutation, you're just a master of the throw.",
      "Your Aghanim's gifting is a great way to show the team that you're ready to retire."
    ],
    "ancient_apparition": [
      "Your Ice Blast misses so much, I thought you were aiming for the next match.",
      "I've seen more chill from a lukewarm cup of tea.",
      "You're the only AA who manages to hit the fountain instead of the teamfight.",
      "Your Chilling Touch does about as much damage as a cold breeze.",
      "Is your goal to see how many times you can miss a Cold Feet on a rooted target?",
      "You're like a ghost of the void who's afraid of the light.",
      "Your Ice Vortex is the only thing 'cool' about you, and it's not working.",
      "I've seen more impact from a snowcone.",
      "Stop trying to gank solo; you have the durability of an icicle in July.",
      "You're an AA who plays like an 'Actual Amateur'.",
      "Your ultimate is called 'Ice Blast,' but it's just a 'Cold Failure'.",
      "I've seen better coordination from a group of frozen statues.",
      "You're like a walking mana-vortex for our team's resources.",
      "Is your 'R' key only for when you're panicking in the base?",
      "Your Cold Feet is a great way to show the enemy exactly where they're safe to stand.",
      "You're the only support who manages to be level 6 at 20 minutes.",
      "Your Ice Vortex is a great metaphor for how your impact is melting away.",
      "I've seen more intelligence from a rock.",
      "You're not a cosmic entity, you're just a cosmic disappointment.",
      "Your Ice Blast is a great way to show the enemy where you *wish* they were."
    ],
    "arc_warden": [
      "Managing two heroes is clearly too much for a brain that can't handle one.",
      "I've seen better bubbles from a pack of gum than from your Magnetic Field.",
      "You're the only Arc Warden who manages to feed both himself and his clone at the same time.",
      "Your Spark Wraith is more like a 'Spark of Incompetence'.",
      "Is your goal to see how many times you can use Flux on a target that's standing next to a creep?",
      "You're like a warden who lost the keys to his own skill.",
      "Your Tempest Double is just a way for the enemy to get a 2-for-1 deal on kills.",
      "I've seen more impact from a static-charged balloon.",
      "Stop trying to micro; you're just confusing yourself and embarrassing us.",
      "You're an Arc Warden who plays like a 'Broke Warden'.",
      "Your ultimate is called 'Tempest Double,' but you're just a 'Double Failure'.",
      "I've seen better coordination from a group of stray magnets.",
      "You're like a walking lag spike for our team's morale.",
      "Is your 'W' key only for protecting the enemy's push?",
      "Your Magnetic Field is a great way to show the enemy exactly where to dump their AOE.",
      "You're the only carry who manages to have 10 items and still do zero damage.",
      "Your Spark Wraith is a great metaphor for how you're just a ghost of a player.",
      "I've seen more intelligence from a neutral creep.",
      "You're not a fragment of the primordial mind, you're just a fragment of a player.",
      "Your Flux is a great way to show the enemy that they should just group up to kill you."
    ],
    "bane": [
      "Your Fiend's Grip is just a way for you to stay still while the enemy kills you.",
      "I've seen more frightening things in a toddler's coloring book.",
      "You're the only Bane who manages to Nightmare his own carry during a fight.",
      "Your Brain Sap is the only thing 'sapping' anything here, and it's our win rate.",
      "Is your goal to see how many times you can use Enfeeble on a support?",
      "You're like a nightmare that nobody even remembers.",
      "Your ultimate is called 'Fiend's Grip,' but the only thing you're gripping is defeat.",
      "I've seen more impact from a bad dream.",
      "Stop trying to gank solo; you have the durability of a wet paper towel.",
      "You're a Bane who plays like a 'Plain' feeder.",
      "Your Nightmare is a great metaphor for how you've cursed our team.",
      "I've seen better coordination from a group of sleepy sloths.",
      "You're like a walking target for every Silence in the game.",
      "Is your 'Q' key only for when the fight is already over?",
      "Your Enfeeble is a great way to show the enemy that you have no idea who the carry is.",
      "You're the only support who manages to miss a single-target stun.",
      "Your Brain Sap is a great way to show the enemy exactly how much HP you don't have.",
      "I've seen more intelligence from a rock.",
      "You're not an elemental of fear, you're just an elemental of failure.",
      "Your Fiend's Grip is a great way to show the enemy team exactly where to use their stuns."
    ],
    "batrider": [
      "Your Flaming Lasso is just a way for you to help the enemy reach our carry faster.",
      "I've seen better flights from a flightless bird.",
      "You're the only Batrider who manages to Firefly directly into a 5-man stun.",
      "Your Sticky Napalm is the only thing 'sticky' about your play: you're stuck in Herald.",
      "Is your goal to see how many times you can miss a Lasso on a stationary target?",
      "You're like a pilot who forgot how to land and how to win.",
      "Your Flamebreak does about as much damage as a candle flame.",
      "I've seen more impact from a charcoal grill.",
      "Stop trying to initiate when you're just going to feed in 2 seconds.",
      "You're a Batrider who plays like a 'Flat-rider'.",
      "Your ultimate is called 'Flaming Lasso,' and you're definitely burning our chances.",
      "I've seen better coordination from a group of dizzy moths.",
      "You're like a walking delivery service for free kills.",
      "Is your 'W' key only for when the enemy has already escaped?",
      "Your Firefly is a great way to show the enemy exactly where you're hiding in the trees.",
      "You're the only initiator who manages to miss a Lasso on a hero that's already hexed.",
      "Your Sticky Napalm is a great metaphor for how you're slowing down our progress.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a rider of the Yama Abyss, you're just a rider of the feed.",
      "Your Lasso is a great way to show the enemy team that you're ready to be executed."
    ],
    "beastmaster": [
      "Your Primal Roar is the only thing loud about you, because your gameplay is silent.",
      "I've seen better beasts in a petting zoo.",
      "You're the only Beastmaster who manages to have his hawk and boar die before the fight starts.",
      "Your Wild Axes do about as much damage as a plastic toy.",
      "Is your goal to see how many times you can miss a Roar on a target standing right in front of you?",
      "You're like a master of animals who's afraid of his own shadow.",
      "Your Inner Beast is the only thing 'inner' about you, because you have no outward impact.",
      "I've seen more impact from a squirrel in a park.",
      "Stop trying to micro; you're just confusing yourself and your poor animals.",
      "You're a Beastmaster who plays like a 'Least-master'.",
      "Your ultimate is called 'Primal Roar,' and you're the one making us scream.",
      "I've seen better coordination from a group of stray cats.",
      "You're like a walking reminder of why micro heroes aren't for you.",
      "Is your 'D' key just for decoration?",
      "Your Hawk is a great way to show the enemy team exactly where you aren't.",
      "You're the only support who manages to lose his summons to a single creep wave.",
      "Your Wild Axes are a great metaphor for how you're just throwing things and hoping they stick.",
      "I've seen more intelligence from a rock.",
      "You're not a wanderer of the wilds, you're just a wanderer of the fountain.",
      "Your Primal Roar is a great way to show the enemy exactly who to target first."
    ],
    "brewmaster": [
      "Managing three spirits is hard when you can barely handle the brain cells for one.",
      "I've seen better drunks at a wedding than your Brewmaster.",
      "You're the only Brewmaster who manages to die before you can even use your ultimate.",
      "Your Cinder Brew is the only thing 'brewing' here, and it's a disaster.",
      "Is your goal to see how many times you can use Primal Split and then do zero stuns?",
      "You're like a master of brew who's always too hungover to play.",
      "Your Drunken Brawler is the only thing 'drunken' about you, because your aim is terrible.",
      "I've seen more impact from a spilled beer.",
      "Stop trying to micro; you're just confusing your spirits and embarrassing us.",
      "You're a Brewmaster who plays like a 'Stew-master'.",
      "Your ultimate is called 'Primal Split,' but you're just splitting our win rate in half.",
      "I've seen better coordination from a group of drunk squirrels.",
      "You're like a walking mana-vortex for our team's patience.",
      "Is your 'W' key only for when you're already at 1 HP?",
      "Your Thunder Clap is a great way to show the enemy exactly where you're standing.",
      "You're the only initiator who manages to miss a stun while in Earth Spirit form.",
      "Your Cinder Brew is a great metaphor for how you're just a mess.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a traveler of the spiritual realm, you're just a traveler of the feeder lane.",
      "Your Primal Split is a great way to show the enemy exactly which spirit to kill first."
    ],
    "broodmother": [
      "Your Spiderlings are doing more work than you are, and they only live for 40 seconds.",
      "I've seen better webs from a spider in a dusty corner.",
      "You're the only Broodmother who manages to lose her entire army to a single support nuke.",
      "Your Insatiable Hunger is the only thing 'insatiable' about you, and it's for feeding.",
      "Is your goal to see how many times you can get caught by a Sentry ward in your own web?",
      "You're like a mother of spiders who's afraid of her own babies.",
      "Your Silken Bola is the only thing 'silky' about your play: it's a tragedy.",
      "I've seen more impact from an ant on the ground.",
      "Stop trying to 'split-push' when you die to a single hero rotation.",
      "You're a Broodmother who plays like a 'Crude-mother'.",
      "Your ultimate is called 'Insatiable Hunger,' and you're definitely eating our MMR.",
      "I've seen better coordination from a group of lost arachnids.",
      "You're like a walking target for every AOE spell in the game.",
      "Is your 'W' key only for hiding when the enemy is already on top of you?",
      "Your Spin Web is a great way to show the enemy exactly where to put their Dust.",
      "You're the only carry who manages to have 100 spiderlings and zero kills.",
      "Your Silken Bola is a great metaphor for how you're just tangling yourself up.",
      "I've seen more intelligence from a rock.",
      "You're not a queen of the dark, you're just a pest.",
      "Your Spiderlings are a great way to show the enemy team how much gold they can farm from you."
    ],
    "centaur_warrunner": [
      "Your Stampede is just a faster way for our team to run into a 5-man wipe.",
      "I've seen better charges from a dead battery.",
      "You're the only Centaur who manages to miss a Hoof Stomp on a hero that's already rooted.",
      "Your Double Edge does more damage to you than it does to the enemy.",
      "Is your goal to see how many times you can Blink-Stun and hit absolutely nobody?",
      "You're like a warrior of the wastes who's afraid of a little fight.",
      "Your Retaliate is the only thing 'retaliating' about you, and it's barely working.",
      "I've seen more impact from a pony in a parade.",
      "Stop trying to be a tank when you have the durability of a wet cardboard box.",
      "You're a Centaur who plays like a 'Senta-derp'.",
      "Your ultimate is called 'Stampede,' and you're definitely leading us to defeat.",
      "I've seen better coordination from a group of dizzy horses.",
      "You're like a walking billboard for enemy ganks.",
      "Is your 'Q' key only for when you're already at 10% HP?",
      "Your Hoof Stomp is a great way to show the enemy exactly where you're standing.",
      "You're the only initiator who waits for the teamfight to be over before jumping in.",
      "Your Double Edge is a great metaphor for how you're just hurting yourself.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a champion of the Omexe, you're just a champion of the feed.",
      "Your Stampede is a great way to show the enemy team exactly where we're all going to die."
    ],
    "chaos_knight": [
      "Your Phantasm is just a way for the enemy to get triple the gold for one kill.",
      "I've seen more consistency from a broken slot machine.",
      "You're the only Chaos Knight who manages to get a 1-second stun every single time.",
      "Your Reality Rift is a great way to bring the enemy closer so they can kill you faster.",
      "Is your goal to see how many times you can miss a kill because of bad RNG?",
      "You're like a horseman of the apocalypse, but the only thing you're ending is our win streak.",
      "Your Chaos Strike is the only thing 'chaotic' about your play: it never happens when we need it.",
      "I've seen more impact from a coin flip.",
      "Stop trying to be a carry; you have the farming speed of a support CM.",
      "You're a CK who plays like a 'S-K' (Seeker of Kills you never get).",
      "Your ultimate is called 'Phantasm,' and your skill level is definitely a ghost.",
      "I've seen better coordination from a group of stray illusions.",
      "You're like a walking reminder of why gambling is a bad idea.",
      "Is your 'W' key only for pulling yourself into certain death?",
      "Your Chaos Bolt is a great way to show the enemy exactly how much time they have to react.",
      "You're the only carry who manages to have 3 illusions and still lose a 1v1.",
      "Your Reality Rift is a great metaphor for how far you are from the actual game.",
      "I've seen more intelligence from a neutral creep.",
      "You're not a fundamental of the universe, you're just a fundamental failure.",
      "Your Phantasm is a great way to show the enemy exactly which one is the real you."
    ],
    "chen": [
      "Managing five units is a bit much for someone who can't even manage their own hero.",
      "I've seen better leadership from a lost sheep.",
      "You're the only Chen who manages to send the enemy hero back to their base by accident.",
      "Your Holy Persuasion is more like 'Holy Crap, why are you feeding'.",
      "Is your goal to see how many jungle creeps you can deliver to the enemy carry?",
      "You're like a priest who's been excommunicated for bad micro.",
      "Your Hand of God is the only thing 'divine' about you, and it's always on cooldown.",
      "I've seen more impact from a neutral creep's passive.",
      "Stop trying to micro; you're just confusing your own creeps and tilting us.",
      "You're a Chen who plays like a 'Chicken'.",
      "Your ultimate is called 'Hand of God,' but it's more like the 'Finger of Blame'.",
      "I've seen better coordination from a group of wild boars.",
      "You're like a walking mana-vortex for our team's patience.",
      "Is your 'E' key just for sending yourself to the fountain early?",
      "Your Divine Favor is a great way to show the enemy exactly who to target first.",
      "You're the only support who manages to lose all his creeps to a single Wild Axe.",
      "Your Penitence is a great metaphor for the punishment we're enduring by playing with you.",
      "I've seen more intelligence from a rock.",
      "You're not a knight of the fold, you're just a fold-er under pressure.",
      "Your Holy Persuasion is a great way to show the enemy team how many creeps they can farm from you."
    ],
    "clockwerk": [
      "Your Hookshot misses so much, I'm surprised you haven't hit the shopkeeper.",
      "I've seen better aim from a broken compass.",
      "You're the only Clockwerk who manages to trap his own carry inside Power Cogs.",
      "Your Battery Assault is about as threatening as a vibrating phone.",
      "Is your goal to see how many times you can Hookshot into a 5-man wipe?",
      "You're like an engineer who built a suit but forgot to read the manual.",
      "Your Rocket Flare is the only thing you've contributed to the map in 30 minutes.",
      "I've seen more impact from a kitchen timer.",
      "Stop trying to initiate when you're just going to feed in your own cogs.",
      "You're a Clockwerk who plays like a 'Clog-werk'.",
      "Your ultimate is called 'Hookshot,' but you're just 'Hooked on Feeding'.",
      "I've seen better coordination from a group of rusty nuts and bolts.",
      "You're like a walking delivery system for free gold.",
      "Is your 'W' key only for when you're trying to stop us from escaping?",
      "Your Power Cogs are a great way to show the enemy exactly where to dump their AOE.",
      "You're the only initiator who manages to miss a point-blank Hookshot.",
      "Your Battery Assault is a great metaphor for how you're just flailing around.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of machinery, you're just a broken toy.",
      "Your Hookshot is a great way to show the enemy team exactly where you're going to die."
    ],
    "dark_ish_seer": [
      "Your Vacuum is so poorly placed, it couldn't even pull a fly off a wall.",
      "I've seen more strategy from a game of Tic-Tac-Toe.",
      "You're the only Dark Seer who manages to Surge the enemy hero by accident.",
      "Your Ion Shell is doing more damage to our lane equilibrium than to the enemy.",
      "Is your goal to see how many 0-man Wall of Replicas you can place?",
      "You're like a strategist who's always three steps behind everyone else.",
      "Your ultimate is called 'Wall of Replica,' but the only thing you're replicating is your deaths.",
      "I've seen more impact from a speed bump.",
      "Stop trying to 'combo' when you can't even land a simple Vacuum.",
      "You're a Dark Seer who plays like a 'Dim Seer'.",
      "Your Surge is the only thing fast about your feed rate.",
      "I've seen better coordination from a group of lost illusions.",
      "You're like a walking reminder of why some people shouldn't play offlane.",
      "Is your 'Q' key only for pulling enemies *out* of our ultimates?",
      "Your Wall of Replica is a great way to show the enemy exactly where not to walk.",
      "You're the only support who manages to be level 5 when the enemy carry is level 15.",
      "Your Ion Shell is a great metaphor for how you're just a nuisance to both teams.",
      "I've seen more intelligence from a rock.",
      "You're not a master of the multiverse, you're just a master of the throw.",
      "Your Surge is a great way to show the enemy exactly who to chase down next."
    ],
    "dark_willow": [
      "Your Bedlam does about as much damage as a swarm of angry gnats.",
      "I've seen more frightening things in a garden of daisies.",
      "You're the only Dark Willow who manages to miss a Bramble Maze on a rooted target.",
      "Your Shadow Realm is just a way for you to hide from your responsibilities.",
      "Is your goal to see how many times you can use Cursed Crown and have it get dispelled immediately?",
      "You're like a faerie who's afraid of her own shadow.",
      "Your ultimate is called 'Terrorize,' and you're definitely scaring our win rate away.",
      "I've seen more impact from a butterfly's sneeze.",
      "Stop trying to be a carry; your attack speed is slower than a snail's pace.",
      "You're a Mireska who plays like a 'Mess-ka'.",
      "Your Bedlam is a great metaphor for how much noise you make without actually doing anything.",
      "I've seen better coordination from a group of panicked fireflies.",
      "You're like a walking target for every AOE disable in the game.",
      "Is your 'W' key only for when you're trying to dodge the blame?",
      "Your Bramble Maze is a great way to show the enemy exactly where to walk to stay safe.",
      "You're the only support who manages to have a 20-minute Aghanim's and zero kills.",
      "Your Cursed Crown is a great metaphor for your gameplay: slow and easy to ignore.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a faerie rebel, you're just a faerie failure.",
      "Your Terrorize is a great way to show the enemy team exactly where to run to win the game."
    ],
    "death_prophet": [
      "Your Exorcism is just a way for you to lead a parade of ghosts into your own grave.",
      "I've seen more presence from a ghost in a vacuum cleaner.",
      "You're the only Death Prophet who manages to use Silence on a hero with no mana.",
      "Your Crypt Swarm is about as threatening as a swarm of moths.",
      "Is your goal to see how many times you can use Spirit Siphon on an illusion?",
      "You're like a prophet who's always predicting the wrong winner.",
      "Your ultimate is called 'Exorcism,' but you're the one who needs to be kicked out.",
      "I've seen more impact from a tombstone in a graveyard.",
      "Stop trying to push when you die to a single support nuke.",
      "You're a Krobelus who plays like a 'Crow-bel-useless'.",
      "Your Silence is a great metaphor for how much you've contributed to the team chat.",
      "I've seen better coordination from a group of lost spirits.",
      "You're like a walking reminder of why mid-lane isn't for you.",
      "Is your 'E' key only for when the fight is already over?",
      "Your Spirit Siphon is a great way to show the enemy exactly who to focus down.",
      "You're the only mid-laner who manages to be level 6 at 15 minutes.",
      "Your Crypt Swarm is a great metaphor for how you're just throwing things and hoping they land.",
      "I've seen more intelligence from a rock.",
      "You're not a harbinger of death, you're just a harbinger of a loss.",
      "Your Exorcism is a great way to show the enemy exactly where to dump their AOE spells."
    ],
    "disruptor": [
      "Your Static Storm is so poorly placed, I thought you were trying to water the grass.",
      "I've seen more coordination from a group of toddlers with magnets.",
      "You're the only Disruptor who manages to Glimpse the enemy hero *out* of our own ultimate.",
      "Your Kinetic Field is about as strong as a wet paper fence.",
      "Is your goal to see how many times you can miss a 3-man combo?",
      "You're like a storm-crafter who's afraid of a little thunder.",
      "Your ultimate is called 'Static Storm,' but it's just a 'Static Failure'.",
      "I've seen more impact from a static-charged balloon.",
      "Stop trying to initiate when you die to a single auto-attack.",
      "You're a Disruptor who plays like a 'Dis-rub-ter'.",
      "Your Glimpse is a great metaphor for how we wish we could glimpse a better teammate.",
      "I've seen better coordination from a group of dizzy sheep.",
      "You're like a walking target for every BKB in the game.",
      "Is your 'W' key only for helping the enemy escape?",
      "Your Kinetic Field is a great way to show the enemy exactly where to wait for your storm to end.",
      "You're the only support who manages to miss a Glimpse on a hero running in a straight line.",
      "Your Thunder Strike is a great metaphor for your gameplay: loud, annoying, and pointless.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the storm, you're just a master of the throw.",
      "Your Static Storm is a great way to show the enemy team exactly where to use their Manta Style."
    ],
    "doom": [
      "Your Doom is always on the hero that already used all their spells. Great job.",
      "I've seen more fire from a cold grill.",
      "You're the only Doom who manages to miss a Devour on a large creep.",
      "Your Scorched Earth does more damage to our team's economy than to the enemy.",
      "Is your goal to see how many times you can Doom a target and then have them get denied?",
      "You're like a lord of hell who's afraid of a little heat.",
      "Your ultimate is called 'Doom,' and you're definitely dooming us to failure.",
      "I've seen more impact from a charcoal briquette.",
      "Stop trying to farm for 30 minutes; you're not an Alchemist, you're just slow.",
      "You're a Lucifer who plays like a 'Lose-ifer'.",
      "Your Devour is a great metaphor for how you're eating up all our resources for zero gain.",
      "I've seen better coordination from a group of greedy demons.",
      "You're like a walking billboard for enemy Silences.",
      "Is your 'R' key only for when the fight is already over?",
      "Your Scorched Earth is a great way to show the enemy exactly where you're running away to.",
      "You're the only offlaner who manages to be level 4 at 10 minutes.",
      "Your Infernal Blade is a great metaphor for your gameplay: it only hurts once and then it's over.",
      "I've seen more intelligence from a rock.",
      "You're not the fallen one, you're just the failing one.",
      "Your Doom is a great way to show the enemy team exactly which of their heroes is the least dangerous."
    ],
    "dragon_knight": [
      "Your Dragon Form is just a way for the enemy to have a bigger target to hit.",
      "I've seen more fire from a cigarette lighter.",
      "You're the only Dragon Knight who manages to miss a Dragon Tail on a hero standing right in front of you.",
      "Your Dragon Blood is the only thing keeping you from being a total joke, and it's barely working.",
      "Is your goal to see how many times you can use Fire Breath and hit zero creeps?",
      "You're like a knight who's afraid of his own armor.",
      "Your ultimate is called 'Elder Dragon Form,' but you're just a 'Baby Lizard'.",
      "I've seen more impact from a pet gecko.",
      "Stop trying to be a carry; your right-clicks hit like a support Ogre Magi.",
      "You're a Davion who plays like a 'D-fail-on'.",
      "Your Fire Breath is a great metaphor for how much hot air you're blowing in the chat.",
      "I've seen better coordination from a group of dizzy lizards.",
      "You're like a walking target for every armor-reduction spell in the game.",
      "Is your 'W' key only for when the enemy has already BKB'd?",
      "Your Dragon Tail is a great way to show the enemy exactly where you're standing.",
      "You're the only mid-laner who manages to lose tower in 5 minutes with Dragon Blood.",
      "Your Elder Dragon Form is a great metaphor for how you're just a bigger version of a bad player.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a dragon-slayer, you're just a dragon-feeder.",
      "Your Fire Breath is a great way to show the enemy team where to walk to avoid you."
    ],
    "drow_ranger": [
      "Your Marksmanship is the only thing 'marked' about you, and it's a cross on your grave.",
      "I've seen better aim from a blindfolded toddler.",
      "You're the only Drow Ranger who manages to miss every single arrow in a teamfight.",
      "Your Multishot is more like a 'Multi-miss'.",
      "Is your goal to see how many times you can Gust and hit absolutely nobody?",
      "You're like a ranger who's afraid of the woods and the lane.",
      "Your ultimate is called 'Marksmanship,' but you're just a 'Miss-manship' master.",
      "I've seen more impact from a toothpick.",
      "Stop trying to 'carry' when you die to a single jump from any hero.",
      "You're a Traxex who plays like a 'Trash-ex'.",
      "Your Gust is a great metaphor for how much you're blowing this game.",
      "I've seen better coordination from a group of panicked rabbits.",
      "You're like a walking glass cannon, but someone forgot to put the cannon together.",
      "Is your 'E' key just for pushing the lane and getting yourself ganked?",
      "Your Frost Arrows are a great way to show the enemy exactly how fast they can still kill you.",
      "You're the only carry who manages to have 100 agility and zero impact.",
      "Your Multishot is a great metaphor for your gameplay: spread out and hitting nothing.",
      "I've seen more intelligence from a rock.",
      "You're not a master of the bow, you're just a master of the throw.",
      "Your Marksmanship is a great way to show the enemy team that you're ready to be jumped."
    ],
    "earth_spirit": [
      "Your Rolling Boulder is just a faster way to feed the enemy backline.",
      "I've seen better rocks in a gravel pit.",
      "You're the only Earth Spirit who manages to kick the enemy hero away from our kill.",
      "Your Magnetize is more like a 'Please Kill Me' beacon.",
      "Is your goal to see how many remnants you can waste in the first 2 minutes?",
      "You're like a sculptor who only makes statues of his own failure.",
      "Your Boulder Smash misses so much, I thought you were playing dodgeball.",
      "I've seen more impact from a pebble in a sneaker.",
      "Stop trying to be JerAx; you're barely a rolling stone.",
      "You're an Earth Spirit who plays like a 'Dirt Spirit'.",
      "Your ultimate is called 'Magnetize,' but the only thing you're attracting is reports.",
      "I've seen better coordination from a pile of loose bricks.",
      "You're like a walking hazard to your own team.",
      "Is your 'D' key just for decoration?",
      "Your Grip is a great way to show the enemy exactly who to target next.",
      "You're the only support who manage to run out of remnants before the fight even starts.",
      "Your Rolling Boulder is a great metaphor for your MMR: rolling downhill fast.",
      "I've seen more intelligence from a rock.",
      "You're not a master of stone, you're just a master of the throw.",
      "Your Geomagnetic Grip is a great way to help the enemy escape."
    ],
    "elder_titan": [
      "Your Earth Splitter is so slow the enemy has time to finish their next item before it lands.",
      "I've seen better cracks in a dry sidewalk.",
      "You're the only Elder Titan who manage to sleep the enemy right before our carry's big nuke.",
      "Your Astral Spirit is doing more work than you are, and it doesn't even have a physical body.",
      "Is your goal to see how many times you can miss a 5-man stomp on a rooted team?",
      "You're like a world-smith who forgot how to use a hammer.",
      "Your Natural Order is the only thing 'natural' about your play: it's naturally terrible.",
      "I've seen more impact from a light tap on the shoulder.",
      "Stop trying to be an initiator; you have the reaction time of a glacier.",
      "You're an Elder Titan who plays like an 'Elderly Failure'.",
      "Your ultimate is called 'Earth Splitter,' but you're just splitting our chances of winning.",
      "I've seen better coordination from a group of confused ghosts.",
      "You're like a walking mana-vortex for our team's patience.",
      "Is your 'W' key only for scouting the enemy fountain?",
      "Your Astral Spirit is a great way to show the enemy exactly where you aren't.",
      "You're the only support who manages to hit a 5-man stomp and then walk away.",
      "Your Natural Order is a great metaphor for how you're just a background character.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a creator of worlds, you're just a creator of losses.",
      "Your stomp is a great way to show the enemy where to use their BKB."
    ],
    "enchantress": [
      "Your Impetus does about as much damage as a thrown marshmallow.",
      "I've seen better healing from a lukewarm glass of water.",
      "You're the only Enchantress who manage to enchant a creep that's already dying.",
      "Your Nature's Attendants is just a slow way to watch yourself die.",
      "Is your goal to see how many times you can get 1-shotted by a physical carry?",
      "You're like a forest sprite who's afraid of the trees.",
      "Your ultimate is called 'Untouchable,' but everyone is definitely touching you... and killing you.",
      "I've seen more impact from a dandelion in the wind.",
      "Stop trying to 'carry' when you have the durability of a soap bubble.",
      "You're an Aiushtha who plays like an 'I-Used-to-Feed-a'.",
      "Your Sproink is a great metaphor for how you're just jumping away from your problems.",
      "I've seen better coordination from a group of lost deer.",
      "You're like a walking gold-bag for the enemy assassin.",
      "Is your 'W' key only for stealing neutral creeps from your own carry?",
      "Your Enchant is a great way to show the enemy which creep to Midas next.",
      "You're the only support who manages to miss a point-blank Impetus.",
      "Your Nature's Attendants is a great metaphor for your gameplay: pretty but pointless.",
      "I've seen more intelligence from a rock.",
      "You're not a guardian of the woods, you're just a nuisance.",
      "Your Little Friends is a great way to show the enemy who to burst first."
    ],
    "grimstroke": [
      "Your Soulbind is just a way for the enemy team to hold hands while they kill us.",
      "I've seen better ink art from a leaky pen.",
      "You're the only Grimstroke who manages to miss a Stroke of Fate on a hero in a Chrono.",
      "Your Phantom's Embrace is about as threatening as a moth's hug.",
      "Is your goal to see how many times you can Soulbind the wrong two heroes?",
      "You're like a master of ink who's afraid of a blank page.",
      "Your Ink Swell is the only thing 'swelling' about you, and it's our death count.",
      "I've seen more impact from a spilled coffee.",
      "Stop trying to make 'plays' when you can't even land a simple silence.",
      "You're a Grimstroke who plays like a 'Dim-stroke'.",
      "Your ultimate is called 'Soulbind,' and you've definitely bound our souls to defeat.",
      "I've seen better coordination from a group of panicked squids.",
      "You're like a walking target for every dispel in the game.",
      "Is your 'E' key only for when your carry is already at 5% HP?",
      "Your Ink Swell is a great way to show the enemy exactly who to kite next.",
      "You're the only support who manages to silence a hero that's already dead.",
      "Your Stroke of Fate is a great metaphor for your gameplay: long, thin, and hitting nothing.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a dark artist, you're just a dark feeder.",
      "Your Soulbind is a great way to show the enemy which of their ultimates to double-cast on us."
    ],
    "gyrocopter": [
      "Your Call Down is more like a 'Call for Help' because you're dying again.",
      "I've seen more explosive impact from a wet firecracker.",
      "You're the only Gyrocopter who manage to miss a Homing Missile on a hero with no boots.",
      "Your Rocket Barrage is about as dangerous as a bubble bath.",
      "Is your goal to see how many times you can Flak Cannon and hit zero heroes?",
      "You're like a pilot who forgot he's in a warzone and not a parade.",
      "Your ultimate is called 'Call Down,' and you're definitely calling down our win rate.",
      "I've seen more impact from a toy airplane.",
      "Stop building Rapier when you can't even survive a single support nuke.",
      "You're an Aurel who plays like an 'Awful'.",
      "Your Homing Missile is a great metaphor for your gameplay: slow and easy to destroy.",
      "I've seen better coordination from a group of rusty cogs.",
      "You're like a walking scrap-heap for the enemy team.",
      "Is your 'W' key only for alerting the enemy to your location?",
      "Your Flak Cannon is a great way to show the enemy team that you're hitting everything but the target.",
      "You're the only carry who manage to be level 12 when the enemy is level 25.",
      "Your Rocket Barrage is a great metaphor for your flailing: a lot of noise, no result.",
      "I've seen more intelligence from a rock.",
      "You're not a master of the skies, you're just a master of the crash.",
      "Your Call Down is a great way to show the enemy team where to walk to be safe."
    ],
    "hoodwink": [
      "Your Bushwhack misses so much, I thought you were playing 'Pin the Tail on the Donkey'.",
      "I've seen better aim from a cross-eyed squirrel.",
      "You're the only Hoodwink who manages to miss a Sharpshooter on a hero trapped in your own stun.",
      "Your Scurry is just a faster way for you to run into a Sentry ward.",
      "Is your goal to see how many times you can Acorn Shot and hit zero heroes?",
      "You're like a trickster who's only tricking herself into thinking she's good.",
      "Your ultimate is called 'Sharpshooter,' but you're just a 'Dull-shooter'.",
      "I've seen more impact from a falling leaf.",
      "Stop trying to 'carry' with a hero that has the durability of a twig.",
      "You're a Hoodwink who plays like a 'Hood-fail'.",
      "Your Bushwhack is a great metaphor for your gameplay: tangled and confusing.",
      "I've seen better coordination from a group of panicked rodents.",
      "You're like a walking target for every gap-closer in the game.",
      "Is your 'W' key only for throwing at trees that are miles away from the fight?",
      "Your Decoy is a great way to show the enemy exactly where you're hiding.",
      "You're the only support who manages to have 100 farm and zero impact.",
      "Your Acorn Shot is a great metaphor for your gameplay: nuts and going nowhere.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a forest rebel, you're just a forest pest.",
      "Your Sharpshooter is a great way to show the enemy which direction to blink."
    ],
    "huskar": [
      "Your Life Break is just a fancy way to commit suicide with a 50% discount.",
      "I've seen more fire from a cold grill in a rainstorm.",
      "You're the only Huskar who manage to die from your own armlet toggle 10 times in a row.",
      "Your Inner Fire is about as threatening as a warm hug.",
      "Is your goal to see how many times you can Life Break into a hero with Blade Mail?",
      "You're like a warrior of the wastes who's afraid of a little blood.",
      "Your ultimate is called 'Life Break,' and you're definitely breaking ours.",
      "I've seen more impact from a paper cut.",
      "Stop trying to be a 'carry' when you die to a single support stun.",
      "You're a Sacred Warrior who plays like a 'Scared Warrior'.",
      "Your Burning Spears are a great metaphor for how you're burning through our hopes.",
      "I've seen better coordination from a group of dizzy penguins.",
      "You're like a walking target for every Pure damage spell in the game.",
      "Is your 'Q' key only for when you're already at 1% HP?",
      "Your Berserker's Blood is a great way to show the enemy exactly how fast they can kill you.",
      "You're the only carry who manage to lose lane to a support Chen.",
      "Your Inner Fire is a great metaphor for your tilting: it's loud but useless.",
      "I've seen more intelligence from a rock.",
      "You're not a holy warrior, you're just a ritual sacrifice.",
      "Your Life Break is a great way to show the enemy team exactly where to dump their nukes."
    ],
    "io": [
      "Tethering to a hero doesn't help if you're both moving at the speed of a brick.",
      "I've seen better connections from a dial-up modem in a tunnel.",
      "You're the only Io who manage to Relocate his carry directly into the enemy's fountain.",
      "Your Spirits do about as much damage as a light tickle.",
      "Is your goal to see how many times you can break Tether right when the carry needs it?",
      "You're like a fundamental of the universe who forgot the 'functioning' part.",
      "Your ultimate is called 'Relocate,' and you're definitely relocating us to a loss.",
      "I've seen more impact from a static-charged balloon.",
      "Stop trying to 'carry' with Io; you're not Ana, you're just a target.",
      "You're a Wisp who plays like a 'Whimper'.",
      "Your Overcharge is a great metaphor for how much you're overwhelming our patience.",
      "I've seen better coordination from a group of lost fireflies.",
      "You're like a walking battery that the enemy team keeps draining.",
      "Is your 'W' key just for making pretty lights while we die?",
      "Your Tether is a great way to show the enemy exactly which two heroes to AOE stun.",
      "You're the only support who manage to Relocate away and leave the carry to die.",
      "Your Spirits are a great metaphor for your gameplay: floating around with no purpose.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a cosmic force, you're just a glowing feeder.",
      "Your Relocate is a great way to show the enemy where to wait for your return."
    ],
    "jakiro": [
      "Your Macropyre is the only thing 'hot' about your play, and everyone just walks out of it.",
      "I've seen better ice from a freezer with a broken door.",
      "You're the only Jakiro who manage to miss an Ice Path on a hero that's already rooted.",
      "Your Dual Breath is about as threatening as a heavy sigh.",
      "Is your goal to see how many times you can use Liquid Fire on a creep instead of a tower?",
      "You're like a two-headed dragon with zero brains.",
      "Your ultimate is called 'Macropyre,' and you're definitely burning our MMR.",
      "I've seen more impact from a humid day.",
      "Stop trying to be an 'initiator' with a stun that takes 3 years to land.",
      "You're a Twin-Head Dragon who plays like a 'Twin-Head Disaster'.",
      "Your Ice Path is a great metaphor for your gameplay: slow, linear, and easy to avoid.",
      "I've seen better coordination from a group of dizzy lizards.",
      "You're like a walking target for every assassin in the game.",
      "Is your 'Q' key only for stealing farm from your own mid-laner?",
      "Your Liquid Fire is a great way to show the enemy team that you're hitting everything but them.",
      "You're the only support who manages to miss a point-blank Dual Breath.",
      "Your Macropyre is a great metaphor for your tilting: it's a mess that goes nowhere.",
      "I've seen more intelligence from a rock.",
      "You're not a master of fire and ice, you're just a master of the throw.",
      "Your Ice Path is a great way to show the enemy where to walk to stay safe."
    ],
    "keeper_of_the_light": [
      "Your Illuminate is just a way for you to steal farm from your carry across three different screens.",
      "I've seen better light from a burnt-out bulb.",
      "You're the only Ezalor who manage to Recall a carry into a 5-man ambush.",
      "Your Chakra Magic is the only thing keeping you from being kicked out, and you keep using it on yourself.",
      "Is your goal to see how many times you can miss a Blinding Light on a physical carry?",
      "You're like a keeper of light who's afraid of a little shadow.",
      "Your ultimate is called 'Will-O-Wisp,' and it's definitely leading us into a trap.",
      "I've seen more impact from a flashlight with no batteries.",
      "Stop trying to 'carry' with Dagon; you have the impact of a wet match.",
      "You're an Ezalor who plays like an 'Eza-loser'.",
      "Your Solar Bind is a great metaphor for how you're just tying our team down.",
      "I've seen better coordination from a group of lost horses.",
      "You're like a walking target for every gap-closer in the game.",
      "Is your 'Q' key only for pushing lanes and getting yourself ganked?",
      "Your Illuminate is a great way to show the enemy exactly where you're hiding in the trees.",
      "You're the only support who manages to have 200 CS and zero support items.",
      "Your Will-O-Wisp is a great metaphor for your gameplay: annoying but ultimately ignored.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the primordial light, you're just a master of the throw.",
      "Your Recall is a great way to show the enemy team exactly who to kill next."
    ],
    "kunkka": [
      "Your Ghost Ship lands so far away, even the enemy team is confused about where you're aiming.",
      "I've seen better splashes from a toddler in a puddle than from your Torrent.",
      "You're the only Kunkka who manages to X-mark a teammate right into an enemy stun.",
      "Your Tidebringer is the only thing doing work, because you certainly aren't.",
      "Is your goal to see how many boats you can crash into trees in one game?",
      "You're like a legendary admiral who's actually just a cabin boy with a fancy coat.",
      "Your ultimate is called 'Ghost Ship,' and your contribution to fights is also a ghost.",
      "I've seen more impact from a leaky faucet than from your combo.",
      "Stop trying to be Attacker; you're barely even a deckhand.",
      "You're a Kunkka who plays like a 'Sunk-ka'.",
      "Your X-Marks-the-Spot is a great metaphor for exactly where we're going to lose.",
      "I've seen better coordination from a group of seasick landlubbers.",
      "You're like a walking target for every BKB in the game.",
      "Is your 'Q' key only for when the enemy is already out of range?",
      "Your Torrent is a great way to show the enemy exactly where they *should* have been.",
      "You're the only mid-laner who manages to miss a boat on a hero you X-marked yourself.",
      "Your Tidebringer is a great metaphor for your gameplay: one big swing and then a long wait for nothing.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the seas, you're just a master of the throw.",
      "Your Ghost Ship is a great way to show the enemy where to walk to be safe."
    ],
    "leshrac": [
      "Your Split Earth misses so much, I thought you were trying to avoid hitting the enemy.",
      "I've seen more fire from a cold candle than from your Pulse Nova.",
      "You're the only Leshrac who manages to Diabolic Edict an empty jungle camp.",
      "Your Lightning Storm is about as dangerous as a static shock from a balloon.",
      "Is your goal to see how many times you can run out of mana in 10 seconds?",
      "You're like a tormentor who's only tormenting his own team.",
      "Your ultimate is called 'Pulse Nova,' but your skill level is a 'Pulse Zero'.",
      "I've seen more impact from a lightbulb in a sunlit room.",
      "Stop running into 5 people with zero armor; you're not a tank, you're a disco ball.",
      "You're a Leshrac who plays like a 'Less-rac'.",
      "Your Nihilism is a great metaphor for how much you've given up on winning.",
      "I've seen better coordination from a group of panicked deer.",
      "You're like a walking mana-vortex for our team's resources.",
      "Is your 'W' key only for when there are no buildings or heroes around?",
      "Your Split Earth is a great way to show the enemy exactly where you *wish* they stood.",
      "You're the only mid-laner who manage to have zero items after 20 minutes of 'farming'.",
      "Your Lightning Storm is a great metaphor for your gameplay: flashy but ultimately harmless.",
      "I've seen more intelligence from a rock.",
      "You're not an entity of pure energy, you're just an entity of pure feed.",
      "Your Pulse Nova is a great way to show the enemy exactly where to dump their burst damage."
    ],
    "lich": [
      "Your Chain Frost always bounces to a single creep and dies. Perfect execution.",
      "I've seen more chill from a lukewarm cup of coffee.",
      "You're the only Lich who manages to Gaze the enemy hero *away* from our carry.",
      "Your Frost Shield is about as protective as a paper umbrella in a storm.",
      "Is your goal to see how many 0-bounce ultimates you can cast in a game?",
      "You're like a dead king who should have stayed buried.",
      "Your ultimate is called 'Chain Frost,' but it's just a 'Chain Failure'.",
      "I've seen more impact from an ice cube in the ocean.",
      "Stop trying to build a Scepter when you don't even have Wards.",
      "You're an Ethreain who plays like an 'Empty-brain'.",
      "Your Sinister Gaze is a great metaphor for how much you're staring at our loss.",
      "I've seen better coordination from a group of frozen statues.",
      "You're like a walking delivery service for enemy gold.",
      "Is your 'E' key only for when you're already dead?",
      "Your Frost Shield is a great way to show the enemy exactly who is the easiest to kill.",
      "You're the only support who manages to hit zero heroes with a Chain Frost in a 60-minute game.",
      "Your Ice Spire is a great metaphor for your gameplay: cold, hard, and useless.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the dead, you're just dead weight.",
      "Your Chain Frost is a great way to show the enemy team that you're out of ideas."
    ],
    "life_stealer": [
      "Your Infest is just a way for you to hide from the fact that you're useless.",
      "I've seen more life stolen by a mosquito.",
      "You're the only Lifestealer who manages to die while inside a 5000 HP Pudge.",
      "Your Rage is the only thing you're good at, mostly because you're tilted.",
      "Is your goal to see how many times you can miss a Feast on a tanky target?",
      "You're like a parasite that's not even helpful to the host.",
      "Your Open Wounds are a great metaphor for how much you're hurting our team.",
      "I've seen better aggression from a kitten.",
      "Stop Infesting the courier; it's not a secret ganking strategy.",
      "You're a Lifestealer who plays like a 'Life-loser'.",
      "Your ultimate is called 'Infest,' but you're just a 'Pest'.",
      "I've seen more impact from a leech.",
      "You're like a walking snack for the enemy carry.",
      "Is your 'Q' key only for when you're running away?",
      "Your Feast is a great way to show the enemy how much HP they still have left.",
      "You're the only carry who manages to get out-hit by a support.",
      "Your Open Wounds are a great way to show the enemy exactly where you are.",
      "I've seen more intelligence from a rock.",
      "You're not a monster, you're just a nuisance.",
      "Your Shadow Step is a great way to show the enemy exactly where you're going to feed."
    ],
    "lone_druid": [
      "You're going from a support who couldn't keep one hero alive to a carry who has to manage two. Let's hope your bear has better luck than your last carry did.",
      "Maybe you should let the bear play the hero and you can just follow it around. It would probably do a better job.",
      "I've seen better micro from a guy with one finger and a broken mouse.",
      "You're the only Lone Druid who manages to have the hero and the bear die in separate lanes.",
      "Your Spirit Bear is doing all the work, which is why it looks so depressed.",
      "Is your goal to see how many times you can lose your bear to a tower?",
      "You're like a hermit who should have stayed in the woods.",
      "Your Savage Roar is the only thing 'savage' about your play, and it's mostly aimed at us.",
      "Stop trying to micro when you can't even handle your own camera.",
      "You're a Sylla who plays like a 'Silly'.",
      "Your ultimate is called 'True Form,' and your true form is a feeder.",
      "I've seen better coordination from a group of lost cubs.",
      "You're like a walking 2-for-1 kill deal for the enemy team.",
      "Is your 'W' key only for when your bear is already dead?",
      "Your Spirit Link is a great metaphor for how you're dragging our win rate down with you.",
      "You're the only carry who manage to have zero items on the hero and 6 items on a bear that can't hit anything.",
      "Your Entangle chance is so low, I thought it was disabled in your version of the game.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a guardian of the forest, you're just a liability with a pet.",
      "Your True Form is a great way to show the enemy team that you're a bigger target."
    ],
    "luna": [
      "Your Eclipse is just a fancy way to turn the lights off so we don't have to see you feed.",
      "I've seen more moonbeams from a flashlight with dead batteries.",
      "You're the only Luna who manages to use your ultimate when there are 50 creeps nearby.",
      "Your Moon Glaives are more like 'Moon Gaffes'.",
      "Is your goal to see how many times you can miss a Lucent Beam on a visible target?",
      "You're like a rider who's afraid of her own mount.",
      "Your ultimate is called 'Eclipse,' but your impact is the only thing being blocked.",
      "I've seen more impact from a crescent moon in a hazy sky.",
      "Stop trying to 'carry' when you die to three auto-attacks from a support.",
      "You're a Luna who plays like a 'Loon-a'.",
      "Your Lunar Blessing is a great metaphor for how much you're not helping our team.",
      "I've seen better coordination from a group of dizzy cats.",
      "You're like a walking glass cannon, but someone forgot to load the ammo.",
      "Is your 'E' key just for stealing farm from lanes we're trying to push?",
      "Your Lucent Beam is a great way to show the enemy exactly how little damage you do.",
      "You're the only carry who manage to have 400 GPM in a 60-minute game.",
      "Your Moon Glaives are a great metaphor for your gameplay: bouncing around with no direction.",
      "I've seen more intelligence from a rock.",
      "You're not a moon rider, you're just a moon-feeder.",
      "Your Eclipse is a great way to show the enemy exactly where to stand to take zero damage."
    ],
    "lycan": [
      "Your Shapeshift is just a faster way for you to run into a Sentry ward and die.",
      "I've seen more ferocity from a Pomeranian.",
      "You're the only Lycan who manages to have his wolves die to a single creep wave.",
      "Your Howl is the only thing loud about you, because your gameplay is silent.",
      "Is your goal to see how many times you can run away from a fight you could have won?",
      "You're like a wolf-man who's afraid of his own shadow.",
      "Your ultimate is called 'Shapeshift,' but you're just 'Shifting' our MMR to zero.",
      "I've seen more impact from a stray dog in an alley.",
      "Stop trying to 'split-push' when you have zero map awareness.",
      "You're a Banehallow who plays like a 'Bane-of-our-team'.",
      "Your Feral Impulse is a great metaphor for your lack of self-control.",
      "I've seen better coordination from a group of dizzy puppies.",
      "You're like a walking reminder of why micro isn't for everyone.",
      "Is your 'W' key only for when you're already in the fountain?",
      "Your Wolves are a great way to show the enemy exactly where you're hiding.",
      "You're the only carry who manages to have zero impact during the 18 seconds of your ultimate.",
      "Your Howl is a great way to show the enemy that you're panicking.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a lord of the wolves, you're just a lapdog for the enemy carry.",
      "Your Shapeshift is a great way to show the enemy exactly how fast you can feed."
    ],
    "medusa": [
      "Your Stone Gaze is a great way to turn the enemy into statues so they can watch us lose in high-def.",
      "I've seen more durability from a bubble wrap than from your Mana Shield.",
      "You're the only Medusa who manages to run out of mana before the fight even starts.",
      "Your Mystic Snake is more like a 'Mystic Mistake'.",
      "Is your goal to see how many times you can get 1-shotted by an Antimage?",
      "You're like a gorgon who's afraid to look anyone in the eye.",
      "Your ultimate is called 'Stone Gaze,' and that's exactly how we feel watching you play.",
      "I've seen more impact from a garden snake.",
      "Stop trying to 'tank' when you have zero items and zero brains.",
      "You're a Medusa who plays like a 'Meh-dusa'.",
      "Your Mana Shield is a great metaphor for how you're draining our team's energy.",
      "I've seen better coordination from a group of lost reptiles.",
      "You're like a walking gold-bag that's waiting to be popped.",
      "Is your 'E' key just for making your HP bar look bigger while you die?",
      "Your Mystic Snake is a great way to show the enemy exactly how to dodge your spells.",
      "You're the only carry who manage to farm for 50 minutes and still do zero damage.",
      "Your Split Shot is a great metaphor for your gameplay: hitting everything except what matters.",
      "I've seen more intelligence from a rock.",
      "You're not a queen of the sea, you're just a bottom-feeder.",
      "Your Stone Gaze is a great way to show the enemy where to stand to kill you safely."
    ],
    "monkey_king": [
      "Your Wukong's Command is a great way to create a circle of safety for the enemy team.",
      "I've seen more balance from a one-legged stool than from your Tree Dance.",
      "You're the only Monkey King who manages to get stunned while standing on a tree every single time.",
      "Your Boundless Strike is about as threatening as a wet noodle.",
      "Is your goal to see how many times you can jump into a 5-man stun and die in mid-air?",
      "You're like a king of monkeys who's afraid of heights.",
      "Your ultimate is called 'Wukong's Command,' but nobody is listening to your bronze-tier orders.",
      "I've seen more impact from a banana peel on the ground.",
      "Stop trying to be Topson; you're barely even a circus monkey.",
      "You're a Sun Wukong who plays like a 'Sun-fail'.",
      "Your Jingu Mastery is a great metaphor for how long it takes you to actually do something useful.",
      "I've seen better coordination from a group of dizzy apes.",
      "You're like a walking target for every tree-cutting spell in the game.",
      "Is your 'W' key only for getting yourself caught in the trees?",
      "Your Primal Spring is a great way to show the enemy exactly where you're going to land and feed.",
      "You're the only carry who manage to lose lane to a support Lion.",
      "Your Mischief is a great metaphor for how you're just a prank on our team.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a sage, you're just a nuisance.",
      "Your Wukong's Command is a great way to show the enemy where to stand to take zero damage."
    ],
    "naga_siren": [
      "Your Song of the Siren is the only thing keeping the enemy alive. Thanks for saving them.",
      "I've seen better illusions from a cheap magic trick.",
      "You're the only Naga Siren who manage to use your ultimate right as our carry uses their 5-man stun.",
      "Your Ensnare is about as strong as a wet spiderweb.",
      "Is your goal to see how many times you can use Song of the Siren to help the enemy escape?",
      "You're like a siren who's afraid of the water and her own voice.",
      "Your ultimate is called 'Song of the Siren,' and it's definitely the song of our defeat.",
      "I've seen more impact from a ripple in a pond.",
      "Stop trying to 'micro' your illusions; it's clear you can't even handle one hero.",
      "You're a Slithice who plays like a 'Slith-fail'.",
      "Your Mirror Image is a great metaphor for how much you're just a reflection of a better player.",
      "I've seen better coordination from a group of lost fish.",
      "You're like a walking lag spike for our team's morale.",
      "Is your 'E' key just for hitting your own illusions by accident?",
      "Your Rip Tide is a great way to show the enemy exactly how little damage you do.",
      "You're the only carry who manages to have 10 illusions and still get out-farmed by a support.",
      "Your Ensnare is a great metaphor for how you're just holding our team back.",
      "I've seen more intelligence from a rock.",
      "You're not a queen of the deep, you're just a bottom-feeder.",
      "Your Song of the Siren is a great way to show the enemy that you're ready to let them win."
    ],
    "nature_s_prophet": [
      "Your Teleportation is just a faster way to feed in every lane simultaneously.",
      "I've seen better cliff-jungling from a mountain goat with a concussion.",
      "You're the only Prophet who manages to sprout his own carry and let the enemy escape.",
      "Your Nature's Call is just a way to give the enemy free gold and experience.",
      "Is your goal to see how many times you can TP into the enemy fountain by accident?",
      "You're like a guardian of nature who's actually an invasive species of feeder.",
      "Your ultimate is called 'Wrath of Nature,' but the only one feeling wrath is your team.",
      "I've seen more impact from a falling leaf in a storm.",
      "Stop trying to 'rat' when you can't even take a single tier 1 tower in 40 minutes.",
      "You're a Furion who plays like a 'Fail-urion'.",
      "Your Sprouting is a great metaphor for how you're just boxing us into a loss.",
      "I've seen better coordination from a group of lost treants.",
      "You're like a walking delivery service for the enemy's mid-laner.",
      "Is your 'R' key only for stealing farm from the carry across the map?",
      "Your Teleport is a great way to show the enemy exactly where to group up to kill you.",
      "You're the only core who manages to have 0 hero damage after 30 minutes of 'pressure'.",
      "Your treants are doing more work than you are, and they have no brains.",
      "I've seen more intelligence from a rock.",
      "You're not a prophet, you're just a profit loss for our team.",
      "Your Sprout is a great way to show the enemy team exactly where to use their Tangoes."
    ],
    "necrophos": [
      "Your Reaper's Scythe is just a fancy way to secure a kill on a target that was already dying.",
      "I've seen more life from a tombstone than from your Death Pulse.",
      "You're the only Necrophos who manages to use Ghost Shroud right before the enemy uses a magic nuke.",
      "Your Heartstopper Aura is the only thing 'stopping' here, and it's our win streak.",
      "Is your goal to see how many times you can miss a scythe on a 10% HP target?",
      "You're like a pope of pestilence who's afraid of a little cough.",
      "Your ultimate is called 'Reaper's Scythe,' but you're just 'Reaping' our MMR.",
      "I've seen more impact from a sneeze in a library.",
      "Stop trying to be a tank; you have the durability of a wet paper towel in Ghost Shroud.",
      "You're a Rotund'jere who plays like a 'Rotten-jere'.",
      "Your Death Pulse is a great metaphor for how much you're just pulsing with incompetence.",
      "I've seen better coordination from a group of dizzy plague rats.",
      "You're like a walking mana-vortex for our team's patience.",
      "Is your 'W' key only for making yourself take more magic damage?",
      "Your Ghost Shroud is a great way to show the enemy exactly who to use their dagon on.",
      "You're the only mid-laner who manages to lose lane to a support Io.",
      "Your Heartstopper Aura is a great metaphor for how annoying but ultimately useless you are.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a bringer of death, you're just a bringer of a bad time.",
      "Your Scythe is a great way to show the enemy that you don't know how to math."
    ],
    "night_stalker": [
      "You're a Night Stalker who's afraid of the dark and useless in the light.",
      "I've seen more aggression from a sun-bathing cat.",
      "You're the only NS who manages to spend the entire night farming the jungle.",
      "Your Crippling Fear is just a way to remind us how much we fear your next play.",
      "Is your goal to see how many times you can use Dark Ascension and then find zero kills?",
      "You're like a predator who's actually just a very fast-moving snack.",
      "Your ultimate is called 'Dark Ascension,' but your skill level is in a 'Permanent Descent'.",
      "I've seen more impact from a moth around a porch light.",
      "Stop trying to initiate when you have the map awareness of a mole.",
      "You're a Balanar who plays like a 'Bala-no-impact'.",
      "Your Void is a great metaphor for the empty space where your brain should be.",
      "I've seen better coordination from a group of confused bats.",
      "You're like a walking timer for when the enemy team can safely ignore you.",
      "Is your 'Q' key only for when the enemy has already blinked away?",
      "Your Hunter in the Night is a great way to show the enemy exactly how fast you can feed.",
      "You're the only offlaner who manages to be level 4 during the first night.",
      "Your Crippling Fear is a great metaphor for how you're paralyzing our team's progress.",
      "I've seen more intelligence from a rock.",
      "You're not the lord of the night, you're just a nightmare for your teammates.",
      "Your Dark Ascension is a great way to show the enemy exactly where you're flying to die."
    ],
    "nyx_assassin": [
      "Your Impale misses so much, I'm surprised you haven't hit yourself with your own spikes.",
      "I've seen more stealth from a parade than from your Vendetta.",
      "You're the only Nyx who manages to hit Spiked Carapace *after* the burst damage is over.",
      "Your Mana Burn does about as much damage as a light static shock.",
      "Is your goal to see how many times you can walk over a Sentry ward while invisible?",
      "You're like an assassin who only kills our hopes of winning.",
      "Your ultimate is called 'Vendetta,' but the only one you're getting revenge on is us.",
      "I've seen more impact from a bug on a windshield.",
      "Stop trying to 'scout' when you're just delivering 300 gold to the enemy carry.",
      "You're a Nyx who plays like a 'Nix' (nothing).",
      "Your Impale is a great metaphor for how you're just poking at the problem.",
      "I've seen better coordination from a group of lost beetles.",
      "You're like a walking billboard for why we need a Gem.",
      "Is your 'W' key only for heroes with 0 mana?",
      "Your Spiked Carapace is a great way to show the enemy that you're ready to be ignored.",
      "You're the only support who manages to miss a stun on a hero you're standing on.",
      "Your Mana Burn is a great metaphor for how you're burning through our patience.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a servant of the queen, you're just a pest.",
      "Your Vendetta is a great way to show the enemy exactly where they should put their next Sentry."
    ],
    "ogre_magi": [
      "You have two heads and still can't find a single brain cell between them.",
      "I've seen more skill from a slot machine than from your Multicast.",
      "You're the only Ogre who manages to 4x Multicast a creep while the enemy hero escapes.",
      "Your Ignite is about as threatening as a warm hug.",
      "Is your goal to see how many times you can run out of mana before using a single stun?",
      "You're like a genius who accidentally hit his head... twice.",
      "Your ultimate is called 'Multicast,' but your impact is a 'Single Failure'.",
      "I've seen more impact from a coin flip in a mud pit.",
      "Stop trying to 'carry' with Midas; you're just a high-gold-value feeder.",
      "You're an Aggron who plays like an 'Aggro-feeder'.",
      "Your Fireblast is a great metaphor for your gameplay: a lot of noise, very little result.",
      "I've seen better coordination from a group of dizzy boulders.",
      "You're like a walking reminder that RNG isn't a substitute for skill.",
      "Is your 'W' key only for when the enemy is already dead?",
      "Your Bloodlust is a great way to show the enemy exactly who to kite for the next 30 seconds.",
      "You're the only support who manages to miss a point-blank stun because you were 'thinking'.",
      "Your Multicast is a great metaphor for how you're just hoping for the best.",
      "I've seen more intelligence from a rock.",
      "You're not a master of luck, you're just a disaster of skill.",
      "Your Fireblast is a great way to show the enemy that you're out of mana."
    ],
    "omniknight": [
      "Your Guardian Angel is always 1 second too late, usually after the carry is dead.",
      "I've seen better protection from a screen door in a hurricane.",
      "You're the only Omniknight who manages to use Repel on the enemy hero by accident.",
      "Your Purification does more damage to our team's morale than to the enemy.",
      "Is your goal to see how many times you can fail to save a teammate with your ultimate?",
      "You're like a holy warrior who's forgotten which god he's serving.",
      "Your ultimate is called 'Guardian Angel,' but you're more like a 'Guardian Failure'.",
      "I've seen more impact from a wet band-aid.",
      "Stop trying to 'carry' with Hammer of Purity; you're not Thor, you're just a janitor.",
      "You're a Purist who plays like a 'Poor-ist'.",
      "Your Degen Aura is a great metaphor for how much you're slowing down our win.",
      "I've seen better coordination from a group of lost sheep.",
      "You're like a walking mana-vortex for our team's resources.",
      "Is your 'Q' key only for when you're already at 100% HP?",
      "Your Repel is a great way to show the enemy exactly who they can't stun, so they just kill them with physical damage.",
      "You're the only support who manages to die with all your spells off cooldown.",
      "Your Purification is a great metaphor for how you're just washing away our hopes.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a knight of the All-knowing, you're just a knight of the All-feeding.",
      "Your Guardian Angel is a great way to show the enemy exactly when to wait 5 seconds to kill us."
    ],
    "oracle": [
      "Your False Promise is the only thing you've kept this game: the promise to lose.",
      "I've seen more clarity from a muddy puddle than from your ability descriptions.",
      "You're the only Oracle who manages to kill his own teammate with Flames.",
      "Your Fortune's End is about as final as a 'To Be Continued' screen.",
      "Is your goal to see how many times you can disarm your own carry during their BKB?",
      "You're like a prophet who can see the future, but only the part where we lose.",
      "Your ultimate is called 'False Promise,' and you're definitely delivering on it.",
      "I've seen more impact from a magic 8-ball with 'Try Again' on every side.",
      "Stop trying to 'save' people when you're the one who needs the most help.",
      "You're a Nerif who plays like a 'No-rif'.",
      "Your Fate's Eddies are a great metaphor for how your gameplay is just going in circles.",
      "I've seen better coordination from a group of confused time-travelers.",
      "You're like a walking manual on how to tilt your own teammates.",
      "Is your 'W' key only for when the enemy carry is hitting us?",
      "Your Purifying Flames are a great way to show the enemy exactly who to burst down while they're being healed.",
      "You're the only support who manages to make a fight harder for his own team.",
      "Your Fortune's End is a great metaphor for our team's bank account after playing with you.",
      "I've seen more intelligence from a rock.",
      "You're not a master of fate, you're just a master of the throw.",
      "Your False Promise is a great way to show the enemy exactly where to wait for the kill notification."
    ],
    "outworld_destroyer": [
      "Your Astral Imprisonment is the best save the enemy team has ever had.",
      "I've seen more intelligence from a broken lightbulb than from your Arcane Orb.",
      "You're the only OD who manages to imprisonment a hero right as our carry uses their ultimate.",
      "Your Sanity's Eclipse is more like a 'Sanity's Collapse' for our team.",
      "Is your goal to see how many times you can run out of mana on a hero with infinite mana?",
      "You're like a harbinger from another world who should have stayed there.",
      "Your ultimate is called 'Sanity's Eclipse,' and you've definitely eclipsed our chances of winning.",
      "I've seen more impact from a shadow on the floor.",
      "Stop trying to 'carry' when you can't even hit a stationary target with your ultimate.",
      "You're a Harbinger who plays like a 'Hinger-on'.",
      "Your Essence Flux is a great metaphor for how your skill level is constantly dropping.",
      "I've seen better coordination from a group of lost aliens.",
      "You're like a walking gold-leak for the enemy's mid-laner.",
      "Is your 'W' key only for when we're about to get a kill?",
      "Your Arcane Orb is a great way to show the enemy exactly how much mana you're wasting.",
      "You're the only mid-laner who manages to have 100 intelligence and 0 common sense.",
      "Your Astral Imprisonment is a great metaphor for your gameplay: putting the game on hold for no reason.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a cosmic entity, you're just a cosmic failure.",
      "Your Sanity's Eclipse is a great way to show the enemy exactly how much more mana they have than you."
    ],
    "pangolier": [
      "Your Rolling Thunder is just a way for you to bounce off walls and achieve nothing.",
      "I've seen more grace from a drunk rhinoceros.",
      "You're the only Pangolier who manages to miss a 5-man Swashbuckle on a rooted team.",
      "Your Shield Crash is about as protective as a wet paper plate.",
      "Is your goal to see how many times you can get stuck in a corner while ulting?",
      "You're like a fencer who's afraid of his own blade.",
      "Your ultimate is called 'Rolling Thunder,' but you're just a 'Rolling Blunder'.",
      "I've seen more impact from a bowling ball in a gutter.",
      "Stop trying to be Larl; you're barely even a speed bump.",
      "You're a Donté who plays like a 'Don't-é'.",
      "Your Swashbuckle is a great metaphor for your gameplay: flashy, fast, and pointless.",
      "I've seen better coordination from a group of dizzy hedgehogs.",
      "You're like a walking target for every instant-root in the game.",
      "Is your 'W' key only for when you're trying to jump into the enemy's arms?",
      "Your Lucky Shot is a great way to show the enemy that you're relying entirely on RNG because you have no skill.",
      "You're the only offlaner who manages to hit zero heroes with a 10-second ultimate.",
      "Your Rolling Thunder is a great metaphor for your MMR: bouncing all over the place and going nowhere.",
      "I've seen more intelligence from a rock.",
      "You're not a cavalier, you're just a catastrophe.",
      "Your Swashbuckle is a great way to show the enemy exactly where you're going to land to be stunned."
    ],
    "phoenix": [
      "Your Supernova is just a giant sign for the enemy team to get free gold.",
      "I've seen more fire from a damp matchstick than from your Fire Spirits.",
      "You're the only Phoenix who manages to Icarus Dive directly into an enemy silence.",
      "Your Sun Ray does about as much damage as a lukewarm flashlight.",
      "Is your goal to see how many times you can egg in front of five physical carries?",
      "You're like a bird of myth who's actually just a very fast-moving chicken.",
      "Your ultimate is called 'Supernova,' but you're just a 'Super-failure'.",
      "I've seen more impact from a feather falling in a vacuum.",
      "Stop trying to make plays when you have the durability of a glass ornament.",
      "You're a Phoenix who plays like a 'Feeder-nix'.",
      "Your Fire Spirits are a great metaphor for your gameplay: a lot of effort, zero hits.",
      "I've seen better coordination from a group of dizzy moths.",
      "You're like a walking target for every hero with a high attack speed.",
      "Is your 'W' key only for when the enemy is already on top of you?",
      "Your Icarus Dive is a great way to show the enemy exactly where you're going to land and die.",
      "You're the only support who manages to be lower level than the neutral creeps.",
      "Your Sun Ray is a great metaphor for how you're just pointing at your own failure.",
      "I've seen more intelligence from a rock.",
      "You're not a star reborn, you're just a star that's burning out.",
      "Your egg is a great way to show the enemy exactly where to group up for a free kill."
    ],
    "primal_beast": [
      "Your Pulverize is just a fancy way to help the enemy reach our carry faster.",
      "I've seen more aggression from a sleeping hamster.",
      "You're the only Primal Beast who manages to Onslaught into a cliff and stay there.",
      "Your Trample does about as much damage as a kitten walking on carpet.",
      "Is your goal to see how many times you can miss a 5-man roar?",
      "You're like a prehistoric monster who's afraid of a little fight.",
      "Your ultimate is called 'Pulverize,' but the only thing you're crushing is our hopes.",
      "I've seen more impact from a pebble in a shoe.",
      "Stop trying to initiate when you have the reaction time of a fossil.",
      "You're a Primal Beast who plays like a 'Paltry Beast'.",
      "Your Uproar is a great metaphor for how much noise you make while doing nothing.",
      "I've seen better coordination from a group of dizzy dinosaurs.",
      "You're like a walking billboard for why we need more stuns.",
      "Is your 'Q' key only for running away from fights we're winning?",
      "Your Onslaught is a great way to show the enemy exactly where to aim their stuns.",
      "You're the only offlaner who manages to be level 3 when the enemy carry is level 10.",
      "Your Trample is a great metaphor for your gameplay: loud, messy, and pointless.",
      "I've seen more intelligence from a jungle creep.",
      "You're not an apex predator, you're just a snack for the enemy team.",
      "Your Pulverize is a great way to show the enemy exactly who to target first."
    ],
    "puck": [
      "Your Illusory Orb is a great way to show the enemy where you're *not* going.",
      "I've seen more mobility from a snail on salt.",
      "You're the only Puck who manage to Phase Shift into an enemy stun.",
      "Your Dream Coil is more like a 'Nightmare for our Team'.",
      "Is your goal to see how many times you can Jaunt into certain death?",
      "You're like a faerie dragon that’s afraid of the wind.",
      "Your Waning Rift does about as much damage as a moth’s wings.",
      "I've seen more impact from a butterfly's sneeze.",
      "Stop trying to be elusive when you have the reaction time of a statue.",
      "You're a Puck who plays like a 'Suck'.",
      "Your ultimate is called 'Dream Coil,' but it's just a coil of failure.",
      "I've seen better coordination from a group of headless gnats.",
      "You're like a walking target for every instant-cast silence.",
      "Is your 'E' key only for when you're already at 1 HP?",
      "Your Illusory Orb is a great way to show the enemy team where to wait for your Jaunt.",
      "You're the only mid-laner who manages to miss a Dream Coil on a rooted target.",
      "Your Phase Shift is a great metaphor for how you're shifting away from being useful.",
      "I've seen more intelligence from a rock.",
      "You're not a mischievous dragon, you're just a mischievous feeder.",
      "Your Dream Coil is a great way to show the enemy team exactly where to group up to kill you."
    ],
    "pugna": [
      "Your Life Drain is just a faster way to tell the enemy exactly where to stun you.",
      "I've seen more durability from a bubble wrap than from your hero.",
      "You're the only Pugna who manages to Decrepify his own carry right as they try to right-click.",
      "Your Nether Ward does about as much damage as a static shock.",
      "Is your goal to see how many times you can die to your own ultimate?",
      "You're like a master of the nether who's afraid of a little sunlight.",
      "Your ultimate is called 'Life Drain,' but you're just draining our will to win.",
      "I've seen more impact from a candle in a hurricane.",
      "Stop trying to be a core; you have the HP of a ranged creep.",
      "You're a Pugna who plays like a 'Pug-no'.",
      "Your Nether Blast is a great metaphor for your gameplay: a lot of build-up for no result.",
      "I've seen better coordination from a group of brittle bones.",
      "You're like a walking gold-bag for the enemy assassin.",
      "Is your 'W' key only for saving the enemy from physical damage?",
      "Your Nether Ward is a great way to show the enemy exactly which trees to cut down.",
      "You're the only mid-laner who manages to be level 6 and still lose your tower to a support.",
      "Your Decrepify is a great metaphor for how much you're slowing down our team.",
      "I've seen more intelligence from a jungle creep.",
      "You're not an oblivion mage, you're just an oblivious feeder.",
      "Your Life Drain is a great way to show the enemy team that you're ready to be burst down."
    ],
    "queen_of_pain": [
      "Your Sonic Wave misses so much, I thought you were trying to perform a concert for the creeps.",
      "I've seen more pain from a paper cut than from your Shadow Strike.",
      "You're the only QOP who manages to Blink into a 5-man stun with zero mana.",
      "Your Scream of Pain is the only thing we're hearing from you, and it's mostly in the chat.",
      "Is your goal to see how many times you can Blink into a Sentry ward?",
      "You're like a succubus who's afraid of a little commitment to the game.",
      "Your ultimate is called 'Sonic Wave,' but your skill level is a 'Silent Echo'.",
      "I've seen more impact from a whisper in a storm.",
      "Stop trying to be aggressive when you have the reaction time of a sloth.",
      "You're a QOP who plays like a 'Flop'.",
      "Your Shadow Strike is a great metaphor for your gameplay: slow and easily ignored.",
      "I've seen better coordination from a group of panicked bats.",
      "You're like a walking delivery service for the enemy's mid-laner.",
      "Is your 'Q' key only for when the enemy has already healed?",
      "Your Blink is a great way to show the enemy exactly where to wait for you.",
      "You're the only mid-laner who manages to be 0-5 at 10 minutes with a mobility spell.",
      "Your Scream of Pain is a great metaphor for how much you're hurting our team.",
      "I've seen more intelligence from a rock.",
      "You're not a queen of pain, you're just a pain in the neck.",
      "Your Sonic Wave is a great way to show the enemy where to walk to be safe."
    ],
    "razor": [
      "Your Static Link is the only thing connecting you to this game, and it keeps breaking.",
      "I've seen more electricity from a dead battery than from your Plasma Field.",
      "You're the only Razor who manages to link a support and then run away from them.",
      "Your Eye of the Storm is more like an 'Eye of the Failure'.",
      "Is your goal to see how many times you can lose a 1v1 to a hero with zero damage?",
      "You're like a lightning ghost who's afraid of a little thunder.",
      "Your ultimate is called 'Eye of the Storm,' and we're definitely in the disaster zone.",
      "I've seen more impact from a static-charged balloon.",
      "Stop trying to 'tank' when you have the armor of a wet paper bag.",
      "You're a Razor who plays like a 'Dull blade'.",
      "Your Plasma Field is a great metaphor for your gameplay: it hits everything but the target.",
      "I've seen better coordination from a group of rusty wires.",
      "You're like a walking battery that the enemy team keeps draining.",
      "Is your 'W' key only for when you're already stunned?",
      "Your Static Link is a great way to show the enemy exactly who to kite for 10 seconds.",
      "You're the only carry who manages to have 300 damage and still lose to a Crystal Maiden.",
      "Your Storm Surge is a great metaphor for how much you're rushing to lose.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the narrow maze, you're just a master of the throw.",
      "Your Plasma Field is a great way to show the enemy where to stand to take zero damage."
    ],
    "riki": [
      "Your Permanent Invisibility is just a way for the enemy to kill you without seeing you coming.",
      "I've seen more stealth from a parade than from your gameplay.",
      "You're the only Riki who manages to walk into a Sentry ward and then complain about 'cheating'.",
      "Your Smoke Screen is about as confusing as your item build.",
      "Is your goal to see how many times you can get killed while in Tricks of the Trade?",
      "You're like a stealthy assassin who wears bells on his shoes.",
      "Your ultimate is called 'Cloak and Dagger,' but you're just 'Dagger and Feed'.",
      "I've seen more impact from a shadow in a dark room.",
      "Stop trying to 'scout' when you're just a walking 300 gold bag.",
      "You're a Riki who plays like a 'Rookie'.",
      "Your Backstab is a great metaphor for how you're betraying our team.",
      "I've seen better coordination from a group of blind mice.",
      "You're like a walking reminder of why Gem of True Sight exists.",
      "Is your 'Q' key only for when the enemy has already escaped the smoke?",
      "Your Blink Strike is a great way to show the enemy exactly who is about to die.",
      "You're the only carry who manages to have zero impact while the enemy team has zero wards.",
      "Your Smoke Screen is a great metaphor for your gameplay: a mess that everyone just walks out of.",
      "I've seen more intelligence from a rock.",
      "You're not a prince of the silent, you're just a prince of the useless.",
      "Your Tricks of the Trade is a great way to show the enemy exactly where to wait to stun you."
    ],
    "sand_king": [
      "Your Epicenter is so quiet, I thought you were just having a seizure in the trees.",
      "I've seen more impact from a sandcastle in a tide than from your Burrowstrike.",
      "You're the only Sand King who manages to miss a 5-man stun on a rooted team.",
      "Your Sand Storm is about as dangerous as a dusty room.",
      "Is your goal to see how many times you can cancel your own ultimate with a bad blink?",
      "You're like a lord of the desert who's afraid of a little sand in his shoes.",
      "Your ultimate is called 'Epicenter,' but your skill level is a 'Non-event'.",
      "I've seen more impact from a pebble in a pond.",
      "Stop trying to initiate when you have the reaction time of a tectonic plate.",
      "You're a Crixalis who plays like a 'Crix-fail-is'.",
      "Your Caustic Finale is a great metaphor for our team's hopes after watching you play.",
      "I've seen better coordination from a group of dizzy scorpions.",
      "You're like a walking target for every Sentry ward on the map.",
      "Is your 'Q' key only for trapping yourself on a cliff?",
      "Your Burrowstrike is a great way to show the enemy exactly where you're going to land and die.",
      "You're the only offlaner who manages to hit zero heroes with a 10-second ultimate.",
      "Your Sand Storm is a great metaphor for your gameplay: a lot of noise, zero visibility.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a king of the wastes, you're just a waste of a king.",
      "Your Blink-Epicenter is a great way to show the enemy exactly where to dump their AOE spells."
    ],
    "shadow_demon": [
      "Your Disruption is the best save the enemy team has ever had.",
      "I've seen more impact from a shadow in a dark room than from your Shadow Poison.",
      "You're the only Shadow Demon who manages to Disruption his own carry right as they go for the kill.",
      "Your Demonic Purge is about as threatening as a light shower.",
      "Is your goal to see how many times you can stack poison on a target that's already dead?",
      "You're like a demon lord who's been demoted to a minor nuisance.",
      "Your ultimate is called 'Demonic Purge,' but the only thing you're purging is our win rate.",
      "I've seen more impact from a smudge on a window.",
      "Stop trying to make 'plays' when you can't even hit a simple projectile.",
      "You're a Shadow Demon who plays like a 'Shadow Defeater'.",
      "Your Soul Catcher is a great metaphor for how you're losing your soul to this game.",
      "I've seen better coordination from a group of lost ghosts.",
      "You're like a walking target for every silence in the game.",
      "Is your 'E' key only for when you're alone in the jungle?",
      "Your Disruption is a great way to show the enemy exactly who to group up and kill.",
      "You're the only support who manages to make a fight harder for his own team.",
      "Your Shadow Poison is a great metaphor for your gameplay: slow, predictable, and harmless.",
      "I've seen more intelligence from a rock.",
      "You're not a master of the abyss, you're just an abyss of skill.",
      "Your Demonic Purge is a great way to show the enemy that you're out of ideas."
    ],
    "silencer": [
      "You're a Silencer who's only managed to silence our team's hope.",
      "I've seen better stolen intelligence from a brick wall.",
      "You're the only Silencer who manages to Global Silence *after* the entire team is dead.",
      "Your Last Word is about as impactful as a whisper in a hurricane.",
      "Is your goal to see how many times you can reach 0 stolen intelligence?",
      "You're like a librarian who's afraid of books.",
      "Your ultimate is called 'Global Silence,' but your gameplay is a 'Global Failure'.",
      "I've seen more impact from a 'Mute' button.",
      "Stop trying to be a carry; you hit like a support with a wet napkin.",
      "You're a Nortrom who plays like a 'No-brain-om'.",
      "Your Glaives of Wisdom are a great metaphor for your lack of it.",
      "I've seen better coordination from a mime troupe.",
      "You're like a walking gold bag for the enemy's gap-closers.",
      "Is your 'Q' key only for when the enemy has already used their spells?",
      "Your Arcane Curse is a great way to show the enemy exactly how much mana they have left.",
      "You're the only support who manages to have 0 stacks of intelligence at 40 minutes.",
      "Your Global Silence is a great way to show the enemy exactly when to wait 6 seconds to kill us.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a mage-killer, you're just a mage-feeder.",
      "Your Last Word is a great way to help the enemy time their next stun."
    ],
    "skywrath_mage": [
      "Your Mystic Flare is a great way to show the enemy where to stand to take zero damage.",
      "I've seen better aim from a broken sprinkler.",
      "You're the only Skywrath who manages to run out of mana before the first blood.",
      "Your Arcane Bolt is about as threatening as a bubble.",
      "Is your goal to see how many times you can miss an ultimate on a rooted target?",
      "You're like a magus who's afraid of his own wings.",
      "Your ultimate is called 'Mystic Flare,' but it's just a 'Mystic Flop'.",
      "I've seen more impact from a lightbulb.",
      "Stop trying to gank solo; you have the durability of a glass vase.",
      "You're a Dragonus who plays like a 'Drag-us-down'.",
      "Your Ancient Seal is a great metaphor for how you're sealing our defeat.",
      "I've seen better coordination from a group of dizzy birds.",
      "You're like a walking battery for the enemy Antimage.",
      "Is your 'W' key only for when the enemy is already back at their fountain?",
      "Your Concussive Shot is a great way to show the enemy exactly where you're hiding.",
      "You're the only support who manages to be level 4 at 15 minutes.",
      "Your Mystic Flare is a great metaphor for your flailing: a lot of light, zero result.",
      "I've seen more intelligence from a rock.",
      "You're not a master of the skies, you're just a master of the crash.",
      "Your Arcane Bolt is a great way to show the enemy exactly where you are."
    ],
    "snapfire": [
      "Your Mortimer Kisses miss so much, I thought you were trying to feed the enemy team.",
      "I've seen better aim from a grandmother with a blindfold... wait.",
      "You're the only Snapfire who manages to Scatterblast the air and then apologize.",
      "Your Firesnap Cookie is more like a 'Firesnap Suicide'.",
      "Is your goal to see how many times you can miss a 5-ball ultimate?",
      "You're like a dragon rider who's afraid of her own lizard.",
      "Your ultimate is called 'Mortimer Kisses,' and they're definitely the kisses of death for us.",
      "I've seen more impact from a spitball.",
      "Stop trying to 'carry' when you have the accuracy of a stormtrooper.",
      "You're a Beatrix who plays like a 'Bad-trix'.",
      "Your Lil' Shredder is a great metaphor for your impact: small and easily ignored.",
      "I've seen better coordination from a group of dizzy lizards.",
      "You're like a walking delivery service for free gold.",
      "Is your 'E' key just for wasting mana on towers?",
      "Your Mortimer Kisses are a great way to show the enemy where not to walk.",
      "You're the only support who manages to jump her carry *into* the enemy team.",
      "Your Scatterblast is a great metaphor for your gameplay: spread thin and hitting nothing.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the forge, you're just a forge-feeder.",
      "Your Firesnap Cookie is a great way to help the enemy reach your carry faster."
    ],
    "spirit_breaker": [
      "Your Charge of Darkness is just a faster way for you to feed the enemy backline.",
      "I've seen more speed from a snail on a treadmill.",
      "You're the only SB who manages to charge into a 5-man stun every single time.",
      "Your Nether Strike is about as impactful as a light tap.",
      "Is your goal to see how many times you can miss a bash at 17% chance?",
      "You're like a celestial bull who's afraid of a little red flag.",
      "Your ultimate is called 'Nether Strike,' but you're just 'Nether Winning'.",
      "I've seen more impact from a bump in the road.",
      "Stop charging across the map when you have zero backup; it's not a play, it's a donation.",
      "You're a Barathrum who plays like a 'Bara-dumb'.",
      "Your Greater Bash is a great metaphor for how you're just lucky, not skilled.",
      "I've seen better coordination from a group of stampeding cows.",
      "You're like a walking target for every instant-stun in the game.",
      "Is your 'W' key only for when you're already at 10% HP?",
      "Your Charge is a great way to show the enemy exactly which lane to gank next.",
      "You're the only offlaner who manages to hit zero bashes in a 20-second fight.",
      "Your Bulldoze is a great metaphor for how you're bulldozing our chances of winning.",
      "I've seen more intelligence from a rock.",
      "You're not a space cow, you're just a cow in space.",
      "Your Charge is a great way to show the enemy team that you're ready to be executed."
    ],
    "sven": [
      "Your God's Strength is the only thing 'godly' about you, and you use it to farm small camps.",
      "I've seen more strength from a wet noodle.",
      "You're the only Sven who manages to miss a Storm Bolt on a stationary target.",
      "Your Great Cleave is about as dangerous as a plastic knife.",
      "Is your goal to see how many times you can get kited by a support with no boots while in God's Strength?",
      "You're like a rogue knight who's afraid of a little combat.",
      "Your ultimate is called 'God's Strength,' but your gameplay is 'Pauper's Skill'.",
      "I've seen more impact from a gentle breeze.",
      "Stop trying to 'carry' when you spend the whole fight being kited.",
      "You're a Sven who plays like a 'S-fail'.",
      "Your Warcry is a great metaphor for how much noise you make before dying.",
      "I've seen better coordination from a group of dizzy tin soldiers.",
      "You're like a walking gold-bag for the enemy's kiting spells.",
      "Is your 'Q' key only for when the enemy has already used BKB?",
      "Your Storm Bolt is a great way to show the enemy exactly who to avoid for 2 seconds.",
      "You're the only carry who manages to have a 20-minute Echo Sabre and zero kills.",
      "Your Great Cleave is a great metaphor for how you're just clearing out our hopes.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the blade, you're just a master of the throw.",
      "Your God's Strength is a great way to show the enemy team exactly when to run away for 30 seconds."
    ],
    "terrorblade": [
      "Your Sunder is the best heal the enemy team has ever had. Thanks for saving them.",
      "I've seen more terror from a fluffy kitten than from your Metamorphosis.",
      "You're the only Terrorblade who manages to Sunder a teammate with 100% HP while you're at 10%.",
      "Your Reflection is about as impactful as a mirror in a dark room.",
      "Is your goal to see how many times you can die with Sunder off cooldown?",
      "You're like a demon marauder who's afraid of his own shadow.",
      "Your ultimate is called 'Sunder,' but you're just sundering our win rate.",
      "I've seen more impact from an illusion that's already expired.",
      "Stop trying to 'farm' when the enemy is literally destroying our Ancient.",
      "You're a TB who plays like a 'T-bad'.",
      "Your Metamorphosis is a great metaphor for how you're morphing into a feeder.",
      "I've seen better coordination from a group of panicked reflections.",
      "You're like a walking glass cannon that forgot to bring the gunpowder.",
      "Is your 'E' key only for when you're already too far away to hit anyone?",
      "Your Conjure Image is a great way to show the enemy exactly how many more of you they get to kill.",
      "You're the only carry who manages to have 1000 GPM and zero hero damage.",
      "Your Reflection is a great metaphor for how much you're just a reflection of a better player.",
      "I've seen more intelligence from a rock.",
      "You're not a demon lord, you're just a lord of the feed.",
      "Your Sunder is a great way to show the enemy exactly who to burst down first."
    ],
    "timbersaw": [
      "Your Timber Chain is just a faster way for you to jump into a 5-man stun.",
      "I've seen better woodcutting from a beaver with no teeth.",
      "You're the only Timbersaw who manages to miss a Whirling Death on a hero standing in a forest.",
      "Your Reactive Armor is about as protective as a screen door in a hail storm.",
      "Is your goal to see how many times you can run out of mana in a 5-second fight?",
      "You're like an engineer who's afraid of trees and talent.",
      "Your ultimate is called 'Chakram,' but you're just 'Chak-ramming' our chances into the ground.",
      "I've seen more impact from a toothpick.",
      "Stop trying to 'tank' when the enemy has 5 magic damage heroes.",
      "You're a Rizzrack who plays like a 'Rizz-wreck'.",
      "Your Timber Chain is a great metaphor for how you're just clinging to the trees while we lose.",
      "I've seen better coordination from a group of rusty saws.",
      "You're like a walking scrap-heap for the enemy's magic nukes.",
      "Is your 'Q' key only for when there are no trees around?",
      "Your Chakram is a great way to show the enemy exactly where to walk to stay safe.",
      "You're the only offlaner who manages to be level 5 at 10 minutes with Reactive Armor.",
      "Your Flamethrower is a great metaphor for how you're just burning through our patience.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the machine, you're just a master of the crash.",
      "Your Timber Chain is a great way to show the enemy exactly where you're going to land."
    ],
    "tiny": [
      "Your Toss is the best escape the enemy team has ever had. Thanks for saving them.",
      "I've seen more impact from a pebble in a pond than from your Avalanche.",
      "You're the only Tiny who manages to Toss his own carry into the enemy fountain.",
      "Your Tree Grab is about as dangerous as a twig.",
      "Is your goal to see how many times you can miss the Avalanche-Toss combo?",
      "You're like a giant who's afraid of his own shadow.",
      "Your ultimate is called 'Grow,' but your skill level is staying 'Tiny' forever.",
      "I've seen more impact from a rock in a shoe.",
      "Stop trying to 'initiate' when you have the movement speed of a glacier.",
      "You're a Stone Giant who plays like a 'Stoned Giant'.",
      "Your Avalanche is a great metaphor for how our win rate is falling.",
      "I've seen better coordination from a group of dizzy boulders.",
      "You're like a walking delivery service for free kills.",
      "Is your 'W' key only for helping the enemy escape?",
      "Your Tree Throw is a great way to show the enemy exactly where you *wish* you could aim.",
      "You're the only core who manages to have 0 armor and wonder why you're dying.",
      "Your Grow is a great metaphor for how much bigger of a feeder you're becoming.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a force of nature, you're just a natural disaster for our team.",
      "Your Toss is a great way to show the enemy team exactly who to kill next."
    ],
    "treant_protector": [
      "Your Overgrowth is so poorly timed, the enemy has time to buy an item and come back.",
      "I've seen better protection from a paper bag in a rainstorm.",
      "You're the only Treant who manages to miss a 5-man ultimate on a rooted team.",
      "Your Living Armor is about as useful as a band-aid on a broken tower.",
      "Is your goal to see how many times you can hide in the trees while our team dies?",
      "You're like a guardian of the forest who's afraid of the dark.",
      "Your ultimate is called 'Overgrowth,' but your impact is 'Zero Growth'.",
      "I've seen more impact from a falling acorn.",
      "Stop trying to 'carry' with a hero that moves at the speed of a sloth.",
      "You're a Rooftrellen who plays like a 'Roof-fail-en'.",
      "Your Nature's Guise is a great metaphor for how much you're hiding from the game.",
      "I've seen better coordination from a group of dizzy treants.",
      "You're like a walking target for every Quelling Blade in the game.",
      "Is your 'Q' key only for when you're already surrounded?",
      "Your Leech Seed is a great way to show the enemy exactly how much HP they aren't losing.",
      "You're the only support who manages to be level 3 at 10 minutes.",
      "Your Overgrowth is a great metaphor for your gameplay: slow, predictable, and easily dispelled.",
      "I've seen more intelligence from a rock.",
      "You're not a protector, you're just a liability with bark.",
      "Your Nature's Grasp is a great way to show the enemy where to walk to be safe."
    ],
    "troll_warlord": [
      "Your Battle Trance is just a way for the enemy to lead you into their fountain like a dog on a leash.",
      "I've seen more self-control from a toddler in a candy store.",
      "You're the only Troll who manages to miss an entire ultimate on a target with 10 HP.",
      "Your Whirling Axes are about as threatening as a ceiling fan.",
      "Is your goal to see how many times you can die while in Battle Trance?",
      "You're like a warlord who's afraid of a little conflict.",
      "Your ultimate is called 'Battle Trance,' and you're definitely in a trance of failure.",
      "I've seen more impact from a paper airplane.",
      "Stop trying to 'carry' when you have the map awareness of a brick.",
      "You're a Jah'rakal who plays like a 'Jah-fail-akal'.",
      "Your Fervor is a great metaphor for how much you're rushing to lose.",
      "I've seen better coordination from a group of dizzy trolls.",
      "You're like a walking target for every kiting spell in the game.",
      "Is your 'E' key just for hitting the wrong target?",
      "Your Whirling Axes are a great way to show the enemy exactly where you are.",
      "You're the only carry who manages to have 500 GPM in a 60-minute game.",
      "Your Berserker's Rage is a great metaphor for your tilting in the chat.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the axes, you're just an axe-wielding feeder.",
      "Your Battle Trance is a great way to show the enemy team that they're safe from your control."
    ],
    "tusk": [
      "Your Walrus Punch is about as threatening as a high-five from a toddler.",
      "I've seen better snowballs from a kid in a playground than your 5-man feed-ball.",
      "You're the only Tusk who manages to trap his own carry inside Frozen Sigils.",
      "Your Ice Shards are just a polite way to help the enemy escape our ganks.",
      "Is your goal to see how many teammates you can deliver directly to the enemy fountain?",
      "You're like a warrior of the north who's afraid of a little frostbite.",
      "Your ultimate is called 'Walrus Punch,' but you're just a 'Walrus Failure'.",
      "I've seen more impact from an ice cube in a drink.",
      "Stop trying to make 'plays' when you're just a high-speed delivery service for gold.",
      "You're a Ymir who plays like a 'Why-me-r'.",
      "Your Tag Team is a great metaphor for how you're helping the enemy kill us.",
      "I've seen better coordination from a group of dizzy penguins.",
      "You're like a walking billboard for enemy ganks.",
      "Is your 'Q' key only for blocking our own path to the safety?",
      "Your Snowball is a great way to show the enemy exactly who to AOE stun.",
      "You're the only support who manages to miss a point-blank punch.",
      "Your Frozen Sigil is a great metaphor for your impact: slow, fragile, and useless.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the fist, you're just a master of the throw.",
      "Your Walrus Kick is a great way to save the enemy carry from certain death."
    ],
    "underlord": [
      "Your Fiend's Gate is just a faster way to teleport our team into a 5-man wipe.",
      "I've seen better portals from a broken mirror.",
      "You're the only Underlord who manages to miss a Firestorm on a hero in a Chronosphere.",
      "Your Pit of Malice is about as effective as a hole in a donut.",
      "Is your goal to see how many times you can teleport yourself into the enemy fountain?",
      "You're like a lord of the abyss who's afraid of a little confrontation.",
      "Your ultimate is called 'Fiend's Gate,' and you're the one leading the fiends to our Ancient.",
      "I've seen more impact from a speed bump in an empty parking lot.",
      "Stop trying to 'tank' when you have the durability of a wet paper bag.",
      "You're a Vrogros who plays like a 'Vro-gross'.",
      "Your Atrophy Aura is a great metaphor for how our win rate is shrinking.",
      "I've seen better coordination from a group of lost demons.",
      "You're like a walking delivery service for failed rotations.",
      "Is your 'W' key only for when the enemy has already walked away?",
      "Your Firestorm is a great way to show the enemy where to stand to take zero damage.",
      "You're the only offlaner who manages to be level 4 at 15 minutes.",
      "Your Fiend's Gate is a great metaphor for your gameplay: opening up new ways to lose.",
      "I've seen more intelligence from a rock.",
      "You're not a master of space, you're just a waste of space.",
      "Your ultimate is a great way to show the enemy team that we're ready to give up."
    ],
    "undying": [
      "Your Tombstone is just a giant sign that says 'Free Gold for the Enemy'.",
      "I've seen more life from a statue than from your Soul Rip.",
      "You're the only Undying who manages to die before your first Decay stack.",
      "Your Flesh Golem is about as threatening as a pile of dirty laundry.",
      "Is your goal to see how many times you can drop a Tombstone in a spot with zero enemies?",
      "You're like a god of the dead who's actually just dead weight.",
      "Your ultimate is called 'Flesh Golem,' but you're just a 'Fail Golem'.",
      "I've seen more impact from a zombie in a background shot.",
      "Stop trying to be aggressive when you have the durability of a dry leaf.",
      "You're an Almighty who plays like an 'All-weakling'.",
      "Your Decay is a great metaphor for how your skill level is dropping every minute.",
      "I've seen better coordination from a group of mindless ghouls.",
      "You're like a walking manual on how to lose a lane you should have won.",
      "Is your 'Q' key only for hitting one creep at a time?",
      "Your Soul Rip is a great way to show the enemy exactly how much HP you don't have.",
      "You're the only support who manages to have 0 kills and 15 deaths in a 20-minute game.",
      "Your Tombstone is a great metaphor for your gameplay: immobile and easy to ignore.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a bringer of plague, you're just a bringer of a loss.",
      "Your ultimate is a great way to show the enemy team that you're a bigger target for their nukes."
    ],
    "vengeful_spirit": [
      "Your Nether Swap is just a way for you to choose which of your teammates to sacrifice.",
      "I've seen better aim from a broken toy than from your Magic Missile.",
      "You're the only Venge who manages to swap the enemy hero into safety and yourself into death.",
      "Your Wave of Terror is about as scary as a gentle breeze.",
      "Is your goal to see how many times you can die and achieve absolutely nothing as a ghost?",
      "You're like a spirit of vengeance who's actually just a spirit of feeding.",
      "Your ultimate is called 'Nether Swap,' but you're just 'Nether Helping'.",
      "I've seen more impact from a feather in a windstorm.",
      "Stop trying to be a carry; your right-clicks hit like a support Crystal Maiden.",
      "You're a Shendelzare who plays like a 'Shen-fail-zare'.",
      "Your Vengeance Aura is a great metaphor for how much you're not contributing.",
      "I've seen better coordination from a group of panicked birds.",
      "You're like a walking gold bag for the enemy's mid-laner.",
      "Is your 'Q' key only for when the enemy has already BKB'd?",
      "Your Magic Missile is a great way to show the enemy exactly where you are.",
      "You're the only support who manages to be lower level than the courier while having an aura.",
      "Your Nether Swap is a great metaphor for your gameplay: trade your life for zero gain.",
      "I've seen more intelligence from a rock.",
      "You're not a fallen queen, you're just a falling player.",
      "Your ghost is a great way to show the enemy exactly how many more times they get to kill you."
    ],
    "venomancer": [
      "Your Plague Wards are doing more work than you are, and they can't even move.",
      "I've seen better toxins from a stale piece of bread than from your Poison Sting.",
      "You're the only Veno who manages to miss a Venomous Gale on a hero standing in front of you.",
      "Your Poison Nova is about as dangerous as a humid afternoon.",
      "Is your goal to see how many wards you can place in the wrong direction?",
      "You're like a master of poison who's actually just allergic to the game.",
      "Your ultimate is called 'Noxious Plague,' but you're just 'Noxious to play with'.",
      "I've seen more impact from a mosquito bite.",
      "Stop trying to 'carry' when you have the movement speed of a snail in molasses.",
      "You're a Lesale who plays like a 'Losing-sale'.",
      "Your Poison Sting is a great metaphor for your annoying but ultimately harmless gameplay.",
      "I've seen better coordination from a group of dizzy snakes.",
      "You're like a walking target for every dispel in the game.",
      "Is your 'Q' key only for when the fight is already over?",
      "Your Plague Wards are a great way to show the enemy exactly where to farm extra gold.",
      "You're the only support who manages to have 100 deaths and still think you're 'creating space'.",
      "Your Venomous Gale is a great metaphor for your flailing: a lot of spit, no result.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the jungle, you're just a master of the throw.",
      "Your ultimate is a great way to show the enemy team exactly where to use their Lotus Orb."
    ],
    "viper": [
      "Your Nethertoxin is about as dangerous as a spilled drink on the floor.",
      "I've seen more venom from a garden spider than from your Poison Attack.",
      "You're the only Viper who manages to lose lane to a melee hero.",
      "Your Viper Strike is just a way for you to tell the enemy exactly who to kill first.",
      "Is your goal to see how many times you can run out of mana on a hero with zero active spells?",
      "You're like a nether drake who's afraid of the sky.",
      "Your ultimate is called 'Viper Strike,' but you're just 'Viper Flop'.",
      "I've seen more impact from a green puddle.",
      "Stop trying to be a 'carry' when you have the mobility of a parked car.",
      "You're a Netherdrake who plays like a 'Neither-drake' (neither good nor useful).",
      "Your Corrosive Skin is a great metaphor for how your gameplay is eroding our patience.",
      "I've seen better coordination from a group of dizzy lizards.",
      "You're like a walking billboard for why some heroes shouldn't be played mid.",
      "Is your 'W' key only for when there are no enemies around?",
      "Your Poison Attack is a great way to show the enemy team that you're hitting them for 5 damage.",
      "You're the only mid-laner who manages to be level 6 at 20 minutes.",
      "Your Nethertoxin is a great metaphor for your gameplay: annoying, predictable, and easy to avoid.",
      "I've seen more intelligence from a rock.",
      "You're not a lord of the abyss, you're just a bottom-feeder.",
      "Your Viper Strike is a great way to show the enemy exactly who should kill you next."
    ],
    "visage": [
      "Managing two Familiars is clearly too much for a brain that can't handle one hero.",
      "I've seen better statues from a pigeon-covered park than your Familiars.",
      "You're the only Visage who manages to have his birds die to a single creep wave.",
      "Your Soul Assumption is more like a 'Soul Failure'.",
      "Is your goal to see how many times you can miss a 3-man stun with your birds?",
      "You're like a guardian of the maze who's actually just lost in it.",
      "Your ultimate is called 'Summon Familiars,' but they're the ones who should be summoning a better player.",
      "I've seen more impact from a breeze in a cemetery.",
      "Stop trying to micro; you're just confusing yourself and embarrassing us.",
      "You're a Necro'lic who plays like a 'Necro-fail'.",
      "Your Grave Chill is a great metaphor for how much you're slowing down our win.",
      "I've seen better coordination from a group of lost ghosts.",
      "You're like a walking reminder of why micro heroes aren't for everyone.",
      "Is your 'Q' key only for when you're already dead?",
      "Your Gravekeeper's Cloak is a great way to show the enemy exactly how many times they need to hit you to kill you.",
      "You're the only support who manages to be level 6 at 30 minutes.",
      "Your Soul Assumption is a great metaphor for your gameplay: a lot of build-up for a tiny result.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the dead, you're just dead weight.",
      "Your Familiars are a great way to show the enemy team that they're safe from your control."
    ],
    "warlock": [
      "Your Chaotic Offering is just a way for the enemy to get free gold from a giant rock.",
      "I've seen better bonds from a glue stick than from your Fatal Bonds.",
      "You're the only Warlock who manages to miss a 5-man ultimate on a rooted team.",
      "Your Shadow Word does more damage to our team's morale than it heals.",
      "Is your goal to see how many times you can use Upheaval and hit zero enemies?",
      "You're like a master of the arcane who's afraid of his own books.",
      "Your ultimate is called 'Chaotic Offering,' and you're the one offering our win to the enemy.",
      "I've seen more impact from a pebble in a pool.",
      "Stop trying to be a carry with Aghanim's when you don't even have a single Ward.",
      "You're a Demnok who plays like a 'Dumb-nok'.",
      "Your Fatal Bonds is a great metaphor for how you're dragging our team down with you.",
      "I've seen better coordination from a group of lost demons.",
      "You're like a walking mana-vortex for our team's patience.",
      "Is your 'W' key only for when the fight is already over?",
      "Your Shadow Word is a great way to show the enemy exactly who to focus down.",
      "You're the only support who manages to die with your Golem still in your pocket.",
      "Your Upheaval is a great metaphor for your gameplay: a mess that everyone just walks out of.",
      "I've seen more intelligence from a rock.",
      "You're not a sorcerer, you're just a ritual sacrifice.",
      "Your Golem is a great way to show the enemy team how much gold they can farm from us."
    ],
    "weaver": [
      "Your Time Lapse is just a way for you to relive the mistake you made 5 seconds ago.",
      "I've seen more speed from a turtle on a treadmill than from your Shukuchi.",
      "You're the only Weaver who manages to Shukuchi into an enemy Sentry ward every single time.",
      "Your Swarm is about as threatening as a group of gnats.",
      "Is your goal to see how many times you can use Time Lapse and still end up in the exact same stun?",
      "You're like a master of time who's always 5 seconds too late to the game.",
      "Your ultimate is called 'Time Lapse,' but your skill level is a 'Time Fail'.",
      "I've seen more impact from a loose thread.",
      "Stop trying to 'carry' when you have the durability of a piece of silk.",
      "You're a Skitskurr who plays like a 'Skit-fail'.",
      "Your Geminate Attack is a great metaphor for how you're doubling your feed rate.",
      "I've seen better coordination from a group of lost spiders.",
      "You're like a walking billboard for why we need more detection.",
      "Is your 'W' key only for when you're already at 1 HP?",
      "Your Shukuchi is a great way to show the enemy exactly where to put their Dust.",
      "You're the only carry who manages to have zero impact during a 60-minute game.",
      "Your Swarm is a great metaphor for your gameplay: annoying, small, and easily ignored.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a weaver of fate, you're just a weaver of failure.",
      "Your Time Lapse is a great way to show the enemy that you're ready to die again."
    ],
    "windranger": [
      "Your Shackleshot misses so much, I'm surprised you haven't hit the trees in the next match.",
      "I've seen better aim from a blindfolded archer than from your Powershot.",
      "You're the only Windranger who manages to use Windrun and still get hit by every physical attack.",
      "Your Focus Fire is more like a 'Focus on Failure'.",
      "Is your goal to see how many times you can miss a 2-hero shackle on heroes standing right next to each other?",
      "You're like a master of the wind who's actually just a lot of hot air.",
      "Your ultimate is called 'Focus Fire,' and we're definitely the ones being burned by your play.",
      "I've seen more impact from a gentle breeze.",
      "Stop trying to be a carry; your attack damage is about as high as a support's ego.",
      "You're a Lyralei who plays like a 'Lie-ra-lei' (it's a lie that you're good).",
      "Your Powershot is a great metaphor for your gameplay: loud, predictable, and easily avoided.",
      "I've seen better coordination from a group of dizzy birds.",
      "You're like a walking target for every instant-stun in the game.",
      "Is your 'Q' key only for hitting the one tree that isn't near an enemy?",
      "Your Windrun is a great way to show the enemy exactly who to nuke with magic damage.",
      "You're the only mid-laner who manages to hit zero shackles in a 40-minute game.",
      "Your Focus Fire is a great metaphor for your tilting: it's fast but it's not working.",
      "I've seen more intelligence from a rock.",
      "You're not a ranger of the woods, you're just a liability on a path.",
      "Your Shackleshot is a great way to show the enemy where to stand to take zero damage."
    ],
    "winter_wyvern": [
      "Your Winter's Curse is the best save the enemy team has ever had. Thanks for saving them.",
      "I've seen more chill from a lukewarm cup of tea than from your Splinter Blast.",
      "You're the only Wyvern who manages to Curse the hero our carry just used their BKB on.",
      "Your Cold Embrace is just a way for you to help the enemy time their next stun on our teammate.",
      "Is your goal to see how many times you can kill your own teammate with a bad ultimate?",
      "You're like a dragon of the frost who's afraid of a little cold weather.",
      "Your ultimate is called 'Winter's Curse,' and you're the one bringing the curse to our team.",
      "I've seen more impact from a snowflake on a radiator.",
      "Stop trying to 'save' people when you're just making them easier to kill.",
      "You're an Auroth who plays like an 'Awful-oth'.",
      "Your Splinter Blast is a great metaphor for how your gameplay is falling apart.",
      "I've seen better coordination from a group of lost ice cubes.",
      "You're like a walking manual on how to tilt your own teammates.",
      "Is your 'W' key only for stealing farm from your carry across the map?",
      "Your Cold Embrace is a great way to show the enemy exactly who to group up and kill next.",
      "You're the only support who manages to make a fight 6v4 for the enemy team.",
      "Your Arctic Burn is a great metaphor for your flailing: a lot of flying, no result.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a master of the frost, you're just a master of the throw.",
      "Your ultimate is a great way to show the enemy team that they're safe from our damage."
    ],
    "zeus": [
      "Your Thundergod's Wrath is just a fancy way to steal a kill you didn't work for.",
      "I've seen more electricity from a dead battery than from your Arc Lightning.",
      "You're the only Zeus who manages to run out of mana before the first fight starts.",
      "Your Lightning Bolt is about as threatening as a static shock.",
      "Is your goal to see how many times you can use your ultimate while everyone is at full HP?",
      "You're like a king of gods who's been demoted to a minor nuisance.",
      "Your ultimate is called 'Thundergod's Wrath,' but your impact is a 'Thunder-flop'.",
      "I've seen more impact from a lightbulb in a sunny room.",
      "Stop trying to 'carry' when you have the durability of a glass vase.",
      "You're a Lord of Heaven who plays like a 'Lord of Feeding'.",
      "Your Static Field is a great metaphor for how much you're just standing there doing nothing.",
      "I've seen better coordination from a group of dizzy sheep.",
      "You're like a walking gold-bag for the enemy's gap-closers.",
      "Is your 'W' key only for clearing wards while our Ancient is falling?",
      "Your Heavenly Jump is a great way to show the enemy exactly where you're going to land and die.",
      "You're the only mid-laner who manages to be 0-10 at 15 minutes with global presence.",
      "Your Thundergod's Wrath is a great metaphor for your gameplay: a lot of noise, zero follow-up.",
      "I've seen more intelligence from a rock.",
      "You're not a god, you're just a loud-mouthed feeder.",
      "Your ultimate is a great way to show the enemy team exactly where we have zero vision."
    ],
    "dawnbreaker": [
      "Your Solar Guardian is just a cinematic way to arrive exactly when the fight is already lost.",
      "I've seen better hammer throws from a clumsy blacksmith.",
      "You're the only Dawnbreaker who manages to ult into a 5-man stun and die before the heal lands.",
      "Your Celestial Hammer is more like a 'Celestial Paperweight'.",
      "Is your goal to see how many times you can miss a Starbreaker combo on a rooted target?",
      "You're like a warrior of light who's consistently left in the dark.",
      "Your ultimate is called 'Solar Guardian,' but you're just guarding the enemy's win streak.",
      "I've seen more impact from a glowing stick.",
      "Stop trying to 'save' teammates when you're the one feeding the most.",
      "You're a Valora who plays like a 'Val-error'.",
      "Your Luminosity is a great metaphor for how rarely you actually shine in this game.",
      "I've seen better coordination from a group of dizzy fireflies.",
      "You're like a walking battery that the enemy team keeps draining for gold.",
      "Is your 'W' key only for throwing your weapon away when you need it most?",
      "Your Starbreaker is a great way to show the enemy exactly where to stand to kite you.",
      "You're the only offlaner who manages to be level 6 at 20 minutes with global presence.",
      "Your Celestial Hammer is a great metaphor for your gameplay: slow, heavy, and going nowhere.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a herald of the sun, you're just a harbinger of a bad time.",
      "Your Solar Guardian is a great way to show the enemy exactly where to dump their AOE spells."
    ],
    "kez": [
      "Switching between two styles doesn't help when you're terrible at both of them.",
      "I've seen more fluid movements from a rusty gate than from your 'masterful' swordplay.",
      "You're the only Kez who manages to use Falcon Rush directly into a Techies minefield.",
      "Your Grappling Claw is just a faster way for you to pull yourself into a grave.",
      "Is your goal to see how many times you can switch stances without pressing a single useful button?",
      "You're like a bird of prey that's actually just a very confused pigeon.",
      "Your ultimate is called 'Raven's Veil,' but the only thing you're veiling is your lack of skill.",
      "I've seen more impact from a feather in a breeze.",
      "Stop trying to be a 'combo master' when you can't even hit a simple auto-attack.",
      "You're a Kazurai who plays like a 'Kez-ual' feeder.",
      "Your Echo Slash is a great metaphor for how much you're just echoing better players' mistakes.",
      "I've seen better coordination from a group of headless chickens.",
      "You're like a walking manual on how to miss every skillshot in a single kit.",
      "Is your 'D' key stuck, or are you just stance-dancing for the aesthetic while we lose?",
      "Your Talon Toss is a great way to show the enemy exactly who to burst down next.",
      "You're the only carry who manages to have 8 spells and still do zero damage.",
      "Your Shrike Strike is a great metaphor for your gameplay: a lot of noise and zero bite.",
      "I've seen more intelligence from a neutral creep.",
      "You're not a revolutionary, you're just a nuisance with a sword.",
      "Your Raven's Veil is a great way to show the enemy exactly where to use their Dust."
    ],
    "muerta": [
      "Your Pierce the Veil is just a way to make yourself untouchable while you miss every shot.",
      "I've seen more life from a ghost than from your gameplay.",
      "You're the only Muerta who manages to miss a Dead Shot on a hero standing right in front of you.",
      "Your The Calling is about as scary as a group of friendly butterflies.",
      "Is your goal to see how many times you can run out of mana before getting a single kill?",
      "You're like a master of death who's actually just dying for attention.",
      "Your ultimate is called 'Pierce the Veil,' but you're just 'Piercing' our hopes of winning.",
      "I've seen more impact from a toy pistol.",
      "Stop trying to 'carry' when you have the durability of a porcelain doll.",
      "You're a Muerta who plays like a 'Dead-a' weight.",
      "Your Dead Shot is a great metaphor for your accuracy: it hits everything but the target.",
      "I've seen better coordination from a group of lost spirits.",
      "You're like a walking gold-bag for the enemy assassin.",
      "Is your 'W' key only for making pretty green circles while the enemy escapes?",
      "Your Parting Shot is a great way to help the enemy reach safety faster.",
      "You're the only core who manages to have zero impact during your 8-second ultimate.",
      "Your Gunslinger passive is a great metaphor for your gameplay: double the effort for zero gain.",
      "I've seen more intelligence from a rock.",
      "You're not a mistress of the afterlife, you're just a ritual sacrifice for the enemy carry.",
      "Your Pierce the Veil is a great way to show the enemy exactly when to use their magic immunity."
    ],
    "marci": [
      "Your Unleash is more like a 'Unleash the Feed'.",
      "I've seen more strength from a wet noodle than from your Dispose.",
      "You're the only Marci who manages to throw the enemy hero *into* our dying carry.",
      "Your Rebound is just a fancy way for you to jump into a grave with style.",
      "Is your goal to see how many times you can miss a point-blank stun combo?",
      "You're like a bodyguard who's actually the biggest threat to the person you're protecting.",
      "Your ultimate is called 'Unleash,' and we're definitely the ones suffering from it.",
      "I've seen more impact from a silent movie.",
      "Stop trying to 'carry' when you have the map awareness of a statue.",
      "You're a Marci who plays like a 'Mercy' kill for the enemy.",
      "Your Sidekick is a great metaphor for how much you're just tagging along for the ride.",
      "I've seen better coordination from a group of dizzy gymnasts.",
      "You're like a walking delivery service for free kills.",
      "Is your 'W' key only for jumping away from fights we're winning?",
      "Your Dispose is a great way to show the enemy exactly where to escape to.",
      "You're the only core who manages to hit zero people during a 15-second ultimate.",
      "Your Rebound is a great metaphor for your MMR: jumping around and going nowhere.",
      "I've seen more intelligence from a jungle creep.",
      "You're not a hero, you're just a mute feeder.",
      "Your Unleash is a great way to show the enemy exactly where to use their Ghost Scepter."
    ],
    "largo": [
      "I've seen more rhythm from a broken washing machine than from your strumming.",
      "You're the only Largo who manages to miss the beat while standing still.",
      "Your 'Catchy Lick' is more like a 'Clumsy Groping'.",
      "Are you a Murkroot bard or just a frog that fell on a guitar?",
      "Is your goal to see how many Groovin' stacks you can lose in five seconds?",
      "You're the only support who manages to 'dispel' our own team's chance of winning.",
      "Stop licking the enemy carry; you're supposed to be a hero, not a snack.",
      "Your songs are so out of tune even the living island wants you to shut up.",
      "You have a troupe of disciples, and yet you're the one who needs a teacher.",
      "Is your 'R' key only for when you want to be completely useless and disarmed?",
      "I've seen better melodies from a cat walking on a piano.",
      "You're a Largo who plays like a 'Largo-slow' (and yes, that's a music joke you failed).",
      "Your Groovin' stacks are like your impact on this game: nonexistent.",
      "Stop strumming and start playing the game; we're losing our Ancient.",
      "You're the only frog in the world who can't catch a fly, let alone a hero.",
      "Your tongue is sticky, but your fingers are clearly slippery with all those missed beats.",
      "I've seen more 'Durable' play from a wet paper towel.",
      "You're not an exiled bard, you're just a bard who was kicked out for being bad.",
      "Your 'empowering' music is making the enemy team feel much more powerful.",
      "If you miss one more beat, I'm turning your guitar into a swamp-raft."
    ]

  },
  "performance_roasts": {
    "feeder": [
      "You died so much last game, I'm surprised you're not a ghost.",
      "You should try playing a hero with a reincarnation ability, since you're so good at dying.",
      "Is your 'D' key broken, or do you just enjoy the gray screen?",
      "You're feeding so much, the enemy team should give you a Michelin star.",
      "I've seen less feeding in a homeless shelter.",
      "Are you trying to win the game or just end world hunger?",
      "The enemy team doesn't even need to farm creeps, they just wait for you to respawn.",
      "Your death timer is the only thing higher than your ego.",
      "You spend more time in the fountain than a penny.",
      "At this point, you're not a player, you're a gold mine for the other team.",
      "I’ve seen better survival skills in a horror movie extra.",
      "You're like a buffet: open for everyone and totally free.",
      "Is there a trophy for most deaths? Because you’re definitely the MVP.",
      "Stop trying to make friends with the enemy towers, they clearly hate you.",
      "Your kill-to-death ratio is looking like a temperature in Antarctica.",
      "I didn't know we were playing a delivery simulator, because you keep delivering kills.",
      "You're the reason the enemy team is having a great time.",
      "If dying was an Olympic sport, you’d have the gold medal.",
      "You walk into the enemy team like you’re looking for a hug.",
      "Your gameplay is basically a highlight reel for the enemy carry.",
      "Maybe try a hero with a 'Stay Alive' button, if you can find it.",
      "You're feeding so hard I'm worried about your health.",
      "Your deaths are the only consistent thing about this match.",
      "Are you a professional sacrificial lamb?",
      "I’ve seen towers with more mobility than you.",
      "You’re basically a walking ATM for the enemy team.",
      "The shopkeeper probably knows you by name with all the buybacks you're doing.",
      "Your map awareness is like a blindfold in a dark room.",
      "Stop treating the enemy jungle like it’s your backyard.",
      "You’re dying faster than my hopes of winning this game.",
      "Is the enemy team paying you, or are you just this bad?",
      "You're like a heat-seeking missile for enemy ultimates.",
      "I’ve seen paper bags with more defense than you.",
      "You make the enemy team look like pros just by standing near them.",
      "If you die one more time, I'm calling a priest for your funeral.",
      "Your respawn timer is the most used feature of your UI.",
      "You're giving the word 'disposable' a whole new meaning.",
      "Are you trying to set a world record for most deaths in 30 minutes?",
      "You're the MVP... of the enemy team's economy.",
      "Even the bots are looking at you and shaking their heads.",
      "You're like a target dummy that talks back.",
      "Stop donating your organs to the enemy team.",
      "You’re playing like you have a death wish and a deadline.",
      "I've seen better positioning from a statue.",
      "The enemy team is actually starting to feel bad for you.",
      "You're the human embodiment of a losing streak.",
      "Your hero should just stay at home and watch TV.",
      "You’re feeding so much, the enemy team is getting high cholesterol.",
      "Your contribution to the team is just a series of death notifications.",
      "I've seen more life in a cemetery than in your gameplay.",
      "You're a legend... for all the wrong reasons.",
      "Is your screen black and white? Because you're always dead."
    ],
    "low_gpm": [
      "You have the farming skills of a support Pudge.",
      "You should try playing a hero that doesn't need items, since you're so bad at farming them.",
      "Your GPM is so low, I thought you were playing on a 1920s economy.",
      "You farm like you’re afraid of gold.",
      "I've seen more gold in a tooth than in your inventory.",
      "Your net worth is basically a rounding error.",
      "Are you roleplaying as a peasant?",
      "You’re so poor, the shopkeeper won’t even look at you.",
      "Your gold graph is a flat line, just like your impact.",
      "You couldn't afford a Boots of Speed if the game gave you a loan.",
      "I didn't know we were playing 'Extreme Poverty Simulator'.",
      "You’re farming at the speed of a turtle on a treadmill.",
      "The creeps are actually out-earning you.",
      "Your GPM is lower than my interest in your excuses.",
      "Are you allergic to last-hitting?",
      "You’re so broke, you make the support look like a billionaire.",
      "I’ve seen more income from a lemonade stand in a rainstorm.",
      "You’re the only carry I know who needs a stimulus check.",
      "Is your mouse broken, or do you just miss every creep on purpose?",
      "You’re treating gold like it’s poisonous.",
      "Your items are looking like a 'before' picture in an ad.",
      "You’re so behind, the enemy team is already in the next game.",
      "I’ve seen bots with better financial management.",
      "Your net worth is so low, it’s practically invisible.",
      "Are you waiting for an inheritance to buy your first item?",
      "You’re the human version of a budget cut.",
      "You farm like you’re trying to keep the creeps alive.",
      "Your economy is looking like a total market crash.",
      "You're so poor, you probably have to pay to use the courier.",
      "I've seen better farming from a city kid on a field trip.",
      "Your GPM is so low, it’s actually impressive.",
      "You’re like a black hole for gold: it just disappears.",
      "You’re the reason the team is in debt.",
      "Stop 'saving' the creeps and start hitting them.",
      "Your inventory is just a collection of sadness.",
      "Are you on a 'no-gold' diet?",
      "You’re so broke, you can’t even afford a plan.",
      "Your GPM is the only thing slower than your reaction time.",
      "I've seen more gold in a piggy bank than in your bank account.",
      "You’re farming like you’re allergic to success.",
      "Your net worth is the punchline of this game.",
      "You’re so poor, the enemy team is trying to donate to you.",
      "I didn't know we were playing on 'Hard Mode' for the economy.",
      "You’re the only person who can make a carry look like a ward.",
      "Your GPM is looking like a high school GPA.",
      "You’re so broke, you probably borrow gold from the creeps.",
      "Stop being a pacifist in the jungle and hit something.",
      "Your items are as real as your chances of winning.",
      "You’re the MVP of being broke.",
      "I’ve seen better farming from a rock.",
      "Your gold count is so low, it’s actually a safety hazard.",
      "You’re playing like you’re on a fixed income."
    ]
  },
  "generic_roasts": [
    "The only thing more useless than {hero_name} in your hands is your 'W' key.",
    "I've seen better players in the tutorial.",
    "Are you playing with your feet?",
    "I'd rather have a bot on my team than you."
  ],
  "role_transition_comments": [
    "From {last_role} to {position}? I’ve seen better career moves in a dumpster fire.",
    "You’re really going from {last_role} to {position}? Bold move for someone with your win rate.",
    "Switching from {last_role} to {position} won't hide the fact that you’re the weak link.",
    "I didn't think it was possible to fail at {position} after failing at {last_role}, but here you are.",
    "Going from {last_role} to {position} is like moving from the frying pan into the fire.",
    "Is this a role swap or a cry for help? {last_role} to {position} is desperate.",
    "You were a boosted {last_role}, now you’re just a lost {position}.",
    "Switching to {position} because you couldn't hack it as {last_role}? Classic.",
    "Let’s see if your {position} is as tragic as your {last_role} was.",
    "You’re playing {position} now? I guess the {last_role} community finally kicked you out.",
    "From {last_role} to {position}... it's like you're trying to find new ways to lose.",
    "A {last_role} main in the {position} slot. Prepare for a 4v5, boys.",
    "Hope you brought a map, because going from {last_role} to {position} clearly has you lost.",
    "You’re really doubling down on being useless by switching to {position}, huh?",
    "I’ve seen bots play {position} better than you played {last_role}. Good luck.",
    "Role swapping to {position} won’t fix your lack of mechanics, {last_role}.",
    "If your {position} is anything like your {last_role}, we’re already doomed.",
    "Another {last_role} refugee trying to find a home in {position}. Pathetic.",
    "You’re switching to {position}? I guess someone had to be the sacrificial lamb.",
    "From {last_role} to {position}—the ultimate 'I give up' move.",
    "Let’s see if you can be less of a disaster at {position} than you were at {last_role}.",
    "You couldn't carry as {last_role}, what makes you think you can do it as {position}?",
    "Switching to {position} is just a fancy way of saying you’re a {last_role} failure.",
    "Oh great, a {last_role} player is here to ruin the {position} role now.",
    "Maybe you’ll actually find your brain during the transition from {last_role} to {position}.",
    "You’re moving to {position}? I’d say I’m surprised, but you were a terrible {last_role}.",
    "Brace yourselves, the {last_role} is trying to learn {position} in real-time.",
    "Switching from {last_role} to {position} is just moving the circus to a different tent.",
    "I’d tell you to go back to {last_role}, but you were pretty bad at that too.",
    "Expectations were low for your {last_role}, but they’re subterranean for your {position}.",
    "Is {position} really the best place for a retired {last_role} player?",
    "You’re swapping to {position}? Just try not to feed as much as you did on {last_role}.",
    "Going from {last_role} to {position} is a massive ego check you’re about to fail.",
    "I hope you realized {position} requires more than the zero brain cells you used for {last_role}.",
    "You swapped to {position}? I guess the queue times were too long for a mediocre {last_role}.",
    "Another {last_role} player infected the {position} pool. Great.",
    "If I wanted a {last_role} to play {position}, I’d just play with a bot.",
    "You’re switching to {position}? Stick to the tutorial first, {last_role}.",
    "Your {last_role} was a meme; let's see if your {position} is a full-blown comedy.",
    "Transitioning from {last_role} to {position}? Bold of you to assume you have the skill.",
    "You really think {position} is easier than {last_role}? You’re in for a rude awakening.",
    "Don't bring that {last_role} mentality into my {position} lane.",
    "From {last_role} to {position}. Pick a role and stay bad at it, don't spread the misery.",
    "I'd wish you luck on the swap to {position}, but you didn't even use it on {last_role}.",
    "You're playing {position} now? I guess the 'unskilled' reports finally caught up to your {last_role}.",
    "Watching a {last_role} attempt {position} is my favorite type of horror movie.",
    "You’re really going to try {position}? Your {last_role} was already an eyesore.",
    "Swapping from {last_role} to {position} is just a new way to tilt your teammates.",
    "Let's see if you can manage {position} without crying back to {last_role} in five minutes.",
    "The jump from {last_role} to {position} is high—too bad you have no vertical."
  ]
}